[
  {
    "url": "https://eora.ru/cases/promyshlennaya-bezopasnost",
    "title": "Промышленная безопасность: система для проверки на производствах",
    "content": "En Главная / Портфолио / Автоматизация в промышленности / Кейс контроля ношения СИЗ на производстве Промышленная безопасность: система для проверки на производствах Совместный проект Проблема Чем больше на производстве сотрудников, тем сложнее следить за тем, как они соблюдают правила промышленной безопасности. Например, всегда ли носят каски, очки, униформу. Правильно ли работают за станком и тому подобное. Решение Система распознавания инцидентов по видео в реальном времени и интерфейс для отчётности и управления нарушениями. Автоматизировать наблюдение за промышленной безопасностью на производстве, следить в реальном времени и получать отчёты. Задача 01/ Что можно проверять? Конкретный набор зависит от специфики клиента. есть ли на всех сотрудниках средства индивидуальной защиты: каска, маска, очки, униформа, перчатки и тому подобное соблюдает ли сотрудник регламент: правильно ли обращается с оборудованием. Кому полезно Любым производствам — в цехах и на улице — где необходимо строгое соблюдение техники безопасности. 02/ Система получает данные с нескольких камер сразу С определённой частотой берёт кадры из потока видео Определяет по ним человека, выделяет необходимые зоны, например, голову. Классифицирует объекты в выделенной зоне. Например, наличие или отсутствие каски или маски. Проверяет, что на серии снимков один и тот же человек Если сотрудник нарушает правила работы, фиксируется инцидент В веб-интерфейсе создаётся карточка с инцидентом Ответственный может посмотреть информацию и принять решение, что с ней делать дальше 03/ Как это работает Строим тепловую карту по предсказанию на этом слое. Модель строит предсказание Берём конкретный слой сетки Визуализация принятия решений нейронной сетью 04/ Разработали свой пайплайн, который позволяет быстрее готовить разметку. Разработали модульную архитектуру, которая учитывает, что заказчики могут быть разные. Встроили в свой инструмент разметки возможность управлять сложной разметкой: учитывать разные типы СИЗ — средств защиты. Научились в деталях мониторить скорость работы системы на каждом этапе. Чему мы научились 05/ Интересный факт Можем делать не только на сервере, но и запускаться в более автономном и мобильном формате, даже если единой сети ещё нет. Сергей Соловьев Тимлид Валерий Шляпников Тимлид Тимлид Максим Лукин Команда проекта 06/ Фреймворк машинного обучения. Глубокое-глубокое обучение :) PyTorch Наш внутренний инструмент для разметки данных. ORI MarkUp Инструменты 07/ Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/lamoda-systema-segmentacii-i-poiska-po-pohozhey-odezhde",
    "title": "Система для сегментации и поиска по похожей одежде для интернет-магазина Lamoda",
    "content": "En Главная / Портфолио / Компьютерное зрение и ИИ / Кейс для «Lamoda» Система для сегментации и поиска по похожей одежде для интернет-магазина Lamoda Поиск похожих изображений Lamoda — крупнейший интернет-магазин в России и СНГ Клиент Распознавать, какой тип одежды — например, рубашка или пиджак — надет на модели. Иметь возможность искать одежду по похожим изображениям. Решение Мы разработали два инструмента: один позволяет сегментировать детали одежды на изображениях другой — ищет по похожим изображениям в интернете Задачи 01/ Как модель различает сегменты Шаг 01 Собрали и проанализировали данные для проектов Шаг 02 Разработали модель для сегментации одежды и передали её клиенту Шаг 01 Собрали и проанализировали данные для проектов Шаг 02 Сделали API для поиска похожих изображений и внедрили его Этапы разработки 02/ Мы параллельно работали над двумя инструментами. Сроки разработки 03/ 1 месяц Интересный факт Блузки, рубашки и футболки очень похожи, особенно, если они под кардиганом. Чтобы модель работала точнее, нужно намного больше данных. Алексей Гучко Руководитель проекта Разработчик Вячеслав Шульц Тимлид Владислав Виноградов Команда проекта 04/ Применение Пока инструмент поиска по похожим изображениям работает только для внутреннего использования. Сделали удобную систему разметки, которую теперь можно использовать и в других проектах. На этом проекте мы впервые использовали трансформенные модели для изображений. Чему мы научились 05/ Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/navyki-dlya-golosovyh-assistentov/karas-golosovoy-assistent",
    "title": "Голосовой ассистент в обличье карася",
    "content": "En Главная / Портфолио / Навыки для голосовых ассистентов / Говорящий карась Голосовой ассистент в обличье карася Говорящий карась Демонстрация работы Предложить проект Предыстория Мы подумали, что будет забавно, если голосовой ассистент получит какой-то запоминающийся облик и решили создать говорящего карася. Идея Игрушка в виде карася с искусственным интеллектом Объект разработки В году существовали голосовые ассистенты Siri, Alexa и Дуся (ассистент в России для слабослышащих). Особенность проекта Это один из первых голосовых ассистентов в России. Мы работали над ним до выхода Алисы на рынок. Что умеет карась 01/ *подгружали из Яндекс.Новостей «Не откладывай, блин, на потом» «Пиво или водка?» — «Ну, рыбы предпочитают пиво...» Особенность проекта Мы создавали карася для развлечения , поэтому главная фишка — смешные ответы и движения. История разработки 02/ Перед нами стояла задача научить карася: принимать и отдавать звук обрабатывать ответы обращаться к внешним источникам (например, сервисам погоды, новостей и музыки) Разработка шла долго. Сложности были везде – и на инженерном уровне, и на программном. Трудности проекта Нужно было: чтобы карась двигал челюстями в такт тому, что отдаёт синтезатор речи чтобы карась поворачивал голову в тот момент, когда к нему обращались Так происходила проработка движений карася: «‎Как передать карасю пароль от Wi-Fi?» Роман Доронин Менеджер проекта «Как организовать пробуждающую фразу (“Окей, карась”), чтобы она процессилась на устройстве и работала без интернета?» «Как организовать пробуждающую фразу (“Окей, карась”), чтобы она процессилась на устройстве и работала без интернета?» Роман Доронин Менеджер проекта «‎Как передать карасю пароль от Wi-Fi?» Потребовалась довольно глубокая работа со звуком: Так выглядела промежуточная версия карася: Интервью с инженером проекта Сергеем Попковым Затем мы собрали свой усилитель звука и убрали внешние динамики: А подставку карася заменили – с коробки на тарелку Таким получился наш говорящий карась! Команда проекта 03/ Роман Доронин Менеджер проекта Кофаундер Just AI Дмитрий Чечёткин Инженер Сергей Попков Отвечал за инженерный уровень - микрофон, управление челюстями и головой и интеграцию в вычислительный модуль (Raspberry Pi) Создатель голосового ассистента Дуся и фреймворка ZenBot, отвечал за программную часть проекта Инструменты 04/ В работе мы использовали следующие сервисы: Платформа для создания диалоговых ботов или интерфейса на естественном языке для приложений или веб-сайтов. Крошечный одноплатный компьютер, который часто используется как мозг робота, домашний сервер или просто компьютер. Raspberry Pi Google Speech-to-Text Технология преобразования речи в текст с высокой точностью с помощью API на базе технологий искусственного интеллекта Google. Zenbot Презентация проекта 05/ Мы представили проект “Говорящий карась” на выставке инновационных технологий для решения задач бизнеса Russian tech week. Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/assistenty-dlya-gorodov",
    "title": "Ассистенты городов",
    "content": "En Главная / Портфолио / Навыки для голосовых ассистентов / Ассистенты для городов Ассистенты городов Универсальные помощники для туристов и жителей Основная информация 01/ Чат-боты и навыки в голосовых ассистентах помогают пользователям быстро освоиться в продукте, найти и получить что нужно. Представьте, если бы таким сервисом обзавелась не компания, а город. Жизнь туристов и местных стала бы намного проще, если бы у них появился всезнающий виртуальный помощник! Ассистенты для городов Проект EORA, который позволяет обновить и улучшить информационную инфраструктуру города или региона. Реализация 02/ Мессенджер (чат-бот) Сайт (виджет) Голосовой ассистент (навык) Ассистент для города может жить в мессенджере, запускаться на сайте в виде виджета или быть частью крупной голосовой экосистемы - Алисы, «Сбера», Маруси, Google Assistant . Ассистент для города может жить в мессенджере, запускаться на сайте в виде виджета или быть частью крупной голосовой экосистемы - Алисы, «Сбера», Маруси, Google Assistant. Кому помогает сервис 03/ Туристам Жителям Благодаря ассистенту турист может быстро сориентироваться в городе, получить самую важную и ценную информацию, почувствовать себя не таким чужим. Жителям ассистент поможет с решением бытовых вопросов, начиная с выдачи справок и заканчивая оформлением жалоб и документов. Ассистент способен снизить нагрузку на сотрудников коммунальных служб, упростить поиск разнородной информации. Городской навык для Алисы EORA работает над проектом «Ассистенты для городов» с года. В феврале года наша команда заняла пятое место в хакатоне «Яндекса» по созданию городских навыков для Алисы. Мы научили голосового ассистента принимать жалобы жителей. 04/ С помощью навыка можно сообщение или фотографию. Например, житель может рассказать дорожным службам об огромной яме на оживлённой трассе. Как работает навык: Пользователь авторизуется в приложении Алисы. Каждой жалобе программа присваивает номер и отправляет её ответственной организации. Алиса сообщает пользователю сроки ответа на вопрос. Инструменты 05/ В работе мы использовали собственные сервисы: Фабрика по созданию универсальных диалоговых систем. На этой платформе появляются, например, чат-боты с технологией компьютерного зрения. zDialog Сервис аналитики диалоговых систем: даёт подробную информацию о работе чат-ботов, голосовых ассистентов, контакт-центров в режиме live. OneDash Перейти к zDialog Перейти к OneDash Цитата В мире, где посылки доставляют роботы, а нейросети помогают диагностировать рак, у каждого города должен быть свой виртуальный представитель. Похожие проекты 06/ Навык в Алисе для проверки лотерейных билетов Перейти к проекту Пилот по автоматизации контактного центра «Додо-пиццы» Перейти к проекту Викторина с вопросами об уходе за кошками Перейти к проекту Навык, который читает ребенку сказки перед сном Перейти к проекту Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/avtomatizaciya-v-promyshlennosti/chemrar-raspoznovanie-molekul",
    "title": "Система распознавания рукописных химических схем",
    "content": "En Главная / Портфолио / Автоматизация в промышленности / Кейс для «ХимРар» Система распознавания рукописных химических схем Основная информация 01/ Клиент Задача «Химрар» — российская фармацевтическая компания. Разработать программу для распознавания рукописных химических схем. В штате компании «Химрар» много химиков: регулярно разрабатывают новые молекулы перерисовывают молекулы из научных статей Запрос от ученых: Хотелось бы быстро переводить рукописные наброски в цифровую версию. Чат-бот, возвращающий цифровое представление молекул. Итог разработки Результатом модели клиент остался доволен. Принцип работы 02/ Химик рисует молекулу Фотографирует рисунок Отправляет в телеграм бот Получает цифровое представление молекулы Формат 03/ SMILES -представление — общепринятая спецификация состава и структуры химического вещества. Из SMILES-представления легко однозначно восстановить молекулу в редакторе. Наша программа — работает на произвольных молекулах (существующих и только что придуманных). Нет привязки к базе. Цифры проекта 04/ Год разработки Длительность разработки Набор данных для обучения модели месяца молекул При заявленном качестве 70% мы п олучили 80%, имея небольшой объем исходных данных. Интересный факт Критерий качества 05/ Полностью корректно распознанная молекула. По результатам разработки: Правильно собранные молекулы Практически правильно Неправильно Этапы разработки 06/ сегментация сборка молекулы извлечение атомов извлечение связей проверка наличия связи между атомами построение Сложности, с которыми столкнулись 07\\ Иногда между атомами очень короткое ребро, поэтому на маске сегментации два соседних атома могут слиться в один Бензольные кольца содержат чередующиеся одинарные и двойные связи. Если наша модель некорректно определяла хотя бы один тип связи, то чтобы восстановить бензольное кольцо, приходилось добавлять дополнительную постобработку Некоторые элементы встречались слишком редко в обучающей выборке, поэтому на тесте они плохо обнаруживались Разные разметчики — разные наборы классов Если неправильно распознаны атом/связь, молекула не строится Мы выступали с этим проектом на конференции Big Data Conference. Интересный факт Команда проекта 07/ Data scientist Data scientist Data scientist Эмиль Магеррамов Артем Кондюков Влад Виноградов Где можно применить наработки 09/ Чертежи Электросхемы Карты местности Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/zeptolab-skazki-pro-amnyama-dlya-sberbox",
    "title": "Интерактивные сказки про Ам Няма для умной приставки от «‎Сбера»",
    "content": "En Главная / Портфолио / Навыки для голосовых ассистентов / Кейс для «SberBox» Интерактивные сказки про Ам Няма для умной приставки от «‎Сбера» Приложение для SberBox Клиенты ZeptoLab – разработчик мобильных игр, создатель популярной игры Cut the Rope. Задачи Создать приложение со сказками и интерактивными элементами для ТВ-приставки SberBox и колонки Sberportal, которое поможет ребёнку быстрее уснуть. Персонаж приложения АмНям – главый герой игры Cut the Rope. SberDevices – дочерняя компания «‎Сбера». Производит «‎умные» устройства и сервисы. Основная информация 01/ В приложении можно не только смотреть мультфильмы, но и выполнять задания , отвечать на вопросы рассказчицы Сони. Суть проекта Ребёнок говорит: Как это работает 02/ «АмНям, пора спать» SberBox запускает приложение Ребёнок выбирает сказку и отвечает на вопросы Сони, например «Что Королева сделала с АмНямом?» По окончании сказки Соня отправляет ребёнка спать Дополнительные опции 03/ 01 Ребёнок может отвечать на вопросы голосом или нажимать кнопку на пульте. 03 Соня спрашивает имя ребёнка при запуске программы и «‎запоминает» его. 02 Для распознавании речи используется голосовой интерфейс «‎Сбера». 04 В приложении есть встроенные покупки: новые сказки в библиотеке SberBox Как выглядит приложение 04/ АмНям приветствует ребенка После завершения сказки на экране появляются вопросы с вариантами ответов В облачках появляются мысли АмНяма При выборе правильного ответа АмНям моргает и машет лапой Разработка 05/ Шаг 01 Продумали сценарии приложения Шаг 02 Шаг 03 Шаг 04 Разработали дизайн Шаг 05 Шаг 06 Сделали вёрстку приложения Шаг 07 Добавили в приложение сказки от ZeptoLab Интегрировали приложение с платформой «‎Сбера» Написали тексты сказок Озвучили сказки с актрисой мы сами сделали всю креативную часть ;) Если приложение не распознало имя ребёнка, Соня зовёт его малышом Интересный факт Процесс озвучки 06/ Все диалоги и мультфильмы озвучивает актриса дубляжа Элиза Мартиросова Её голосом также говорит Элли – героиня компьютерной игры The Last of Us Трудности проекта 07/ 01 Проблема Дети часто говорят непонятно, неразборчиво Решение Мы научили сервис переспрашивать ребёнка 02 Проблема На старте не было конкретного ТЗ - только концепции и разрозненные идеи Решение Мы сделали список user story, на основе которых заказчик сформулировал ТЗ 03 Проблема SberBox - новая платформа, мы не умели с ней работать Решение Нам помогали команды SberDevices и ZeptoLab 04 Проблема Мы не умели рисовать в стиле ZeptoLab Решение Нашли художников, которые освоили их технику Команда проекта 08/ Над контентом работали Арт-директор Ангелина Казакова Иллюстратор Татьяна Кулакова Копирайтеры Константин Симонов Татьяна Попова Голос Сони Элиза Мартиросова Запись и монтаж аудио Студия audio-production.ru Разработкой занимались Руководитель проекта Иван Старков Технический директор Сергей Веренцов Backend-разработчики Алексей Шерченков Антон Капридов Frontend-разработчик Даниил Бедердинов Аналитик Анна Марашова Руководитель проекта Иван Старков «Мы очень старались, когда делали это приложение. Ведь оно для детей – а они заслуживают только лучшего.» Цитата Иван Старков Менеджер проекта Интересный факт 09/ распознаёт голосовой помощник Соня имён Итоги 10/ Мы первыми начали разрабатывать проект «Сбера» на его собственной платформе Проект получился очень творческим. Мы писали текст для сказок, придумывали дизайн и вёрстку. Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/goosegaming-algoritm-dlya-ocenki-igrokov",
    "title": "Алгоритм для оценки игроков в Counter Strike, Dota и World of Tanks",
    "content": "En Главная / Портфолио / Компьютерное зрение и ИИ / Кейс для «Goose Gaming» Алгоритм для оценки игроков в Counter Strike, Dota и World of Tanks Клиент Киберспортивное агенство, которое занимается рекламной и продвижением в игровой отрасли. Предыстория Goose Gaming ведут рейтинг игроков в Counter Strike, Dota 2, World of Tanks и Apex. Получить единый критерий оценки игроков. О проекте 01 / Задача Мы создали алгоритм , который определяет сильнейших игроков по количеству заработанных очков и учитывает сложность игры. Что мы сделали Процесс разработки 02/ Шаг 01 Проанализировали статистику игр за девять месяцев Шаг 02 Шаг 03 Шаг 04 Выделили группы игроков с нестандартной статистикой Шаг 05 Шаг 06 Написали алгоритмы оценки игроков: лидеров и всех остальных Интегрировали алгоритм с системой Goose Gaming Высчитали среднюю продолжительность поединка в каждой игре Определили коэффициенты сложности каждой игры Посчитали сумму убитых врагов у трёх самых успешных игроков в разрезе каждой недели. Заметили, что игроки в CS:GO набирают самое большое количество убийств. По Apex данные собирались только с середины октября две тысячи двадцатого года. Как работает алгоритм Посчитали сумму убитых врагов у десяти лучших игроков в разрезе каждой недели. CS:GO вновь лидирует, но отрыв от Dota 2 меньше, количество убийств WoT также не значительно меньше. а под конец Dota 2 вырывается вперёд Следовательно , самые лучшие игроки в CS:GO набирают непропорционально много убийств. Далее, мы посмотрели среднее число убийств у игроков с наименьшими показателями: начиная с одиннадцатого места и до конца. Как видим, среди отстающих тоже доминируют игроки в CS:GO. Если обратить внимание на общее число игроков каждую неделю, то можно увидеть, что Dota 2 – самая массовая игра, а CS:GO, напротив, собирает меньше всего игроков. В итоге: Была построена линейная регрессия, предсказывающая среднее количество убийств в каждой игре. Коэффициент на неделю рассчитывается как отношение предсказаний модели по каждой игре. Коэффициенты корректируются по мере сбора новых данных. На момент сдачи проекта коэффициенты были следующие: Коэффициент сложности - Коэффициент сложности - Коэффициент сложности - Коэффициент сложности - 0,,,/ Это можно объяснить тем, что в CS:GO проще набирать убийства , а также тем, что в выборку попали более мастеровитые игроки . Длительность проекта 04/ 3 недели 4 недели 1 неделя 2 месяца разработка отладка системы запуск Трудности проекта 05/ Проблема Для проведения анализа данных нам нужно было обработать большой массив данных нестандартного формата. Мы оптимизировали эту базу и использовали отдельный сервис для дальнейшей работы с ней. Решение Проблема 5% игроков в каждой игре зарабатывали на порядок больше очков, чем все остальные. Решение Для них был написан отдельный алгоритм оценки. длился проект В играх всегда есть участники с показателями намного выше среднего. В Counter Strike среднее количество убитых врагов в неделю – . У профессионалов эта цифра достигает тысячи. Интересный факт Команда проекта 06/ Разработчик Менеджер Руководитель проекта Константин Кубрак Ринат Муллахметов Александра Щетинина Эмоции от проекта 07/ Менеджер проекта Константин Кубрак «Задача, которую мы решали, выглядела как классический пример из школьного учебника по машинному обучению. Если бы он существовал». Александр Геймер «Алгоритм позволяет решить проблему читерства среди участников рейтинга, потому что он уравнивает возможности». Итоги Goose Gaming используют систему до сих пор В планах - добавление в алгоритм новых игр 08/ Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/dodo-pizza-robot-analitik-otzyvov",
    "title": "Робот-аналитик отзывов в приложении «Додо Пиццы»",
    "content": "En Главная / Портфолио / Компьютерное зрение и ИИ / Кейс для «Додо Пицца». Тикетная система Робот-аналитик отзывов в приложении «Додо Пиццы» Робот для контакт-центра «Додо» Бот на миллион. Итоги проекта 01/ Основная информация «Додо Пицца» - сеть пиццерий, одна из крупнейших сетей общепита в России. Автоматизировать обработку отзывов, которые клиенты оставляют в мобильном приложении «Додо пиццы». Клиент Задача Робот-классификатор, который анализирует тексты отзывов, определяет их тональность, тематику и, если нужно, пересылает операторам. Решение 02/ Что умеет классификатор Распознавать свыше типов жалоб Определять, какие продукты упомянуты в отзыве 03/ Схема работы Пользователь оставляет отзыв в приложении «Додо пиццы» Классификатор анализирует текст и проставляет теги: категорию жалобы, название продукта Текст с тегами отправляется в тикетную систему «Додо» Операторы и другие сотрудники «Додо» обрабатывают отзывы Интересный факт: Одному из пользователей привезли мятую пиццу. Он написал: «Это что такое???» и приложил к отзыву фото. Классификатор разметил отзыв как «Мятая пицца» , хотя не умеет анализировать изображения. 04/ Этапы разработки Изучаем данные: справочник по жалобам «Додо» и тексты отзывов Обучаем сервис на базе отзывов, оставленных в приложении «Додо» Тестируем классификатор, делаем отладку Собираем новые отзывы, обучаем сервис Запускаем классификатор в полноценную работу Эмоции от проекта 09/ Сергей Веренцов Технический директор «Классификатор решает реальную, острую проблему: он «читает» тысячи отзывов пользователей, определяет темы, отделяет важные от неважных - в общем, выполняет работу, с которой операторы «Додо» не могут справиться физически». Цитата «Четыре сезона» хороша и горяча, а вот новая пицца с соусом чипотле приехала практически без соуса, безликая и холодная, как Якен Хгар. Пользователь «Додо» 05/ Команда проекта Менеджер проекта Технический директор Разработчик Сергей Пономаренко Айдар Валеев Сергей Веренцов Ильгизар Мурзаков Tech lead 06/ Итоги В основе работы классификатора - справочник по жалобам «Додо». При каждом изменении справочника нужно собирать и размечать данные, чтобы обучать классификатор. Компания его существенно переработала, объединив или убрав некоторые категории. 07/ Применение Ритейл Доставка Транспорт Банки и другие ЖКХ Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/ifarm-nejroset-dlya-ferm",
    "title": "Нейросеть, которая определяет вес салата по фото",
    "content": "En Главная / Портфолио / Компьютерное зрение и ИИ / Кейс для «IFarm» Нейросеть, которая определяет вес салата по фото Заказчик 01/ iFarm - российский ИТ-стартап, который строит вертикальные фермы с программным управлением для выращивания ягод, овощей, зелени. 02/ Задача Научить нейросеть различать на фото салат романо и предсказывать его вес. Это поможет компании следить за посадками в круглосуточном режиме и узнавать, когда растение начинает отставать в росте. А значит: - Замечать, когда салат начинает отставать в росте - Автоматически регулировать микроклимат в теплице 03/ Что мы сделали Интересный факт Определяя вес салата, нейросеть высчитывает площадь зелёной области на снимке. Как это работает 04/ Стационарные камеры фотографируют салат на полках Снимки отправляются в ИИ-систему EORA Vision Hub Нейросеть определяет параметры растения и сравнивает их с прогнозом Если показатели сильно отличаются, нейросеть говорит об этом Система iFarm регулирует микроклимат в теплице Как это работает 04/ Стационарные камеры фотографируют салат на полках Снимки отправляются в ИИ-систему EORA Vision Hub Нейросеть определяет параметры растения и сравнивает их с прогнозом Если показатели сильно отличаются, нейросеть говорит об этом Система iFarm регулирует микроклимат в теплице Наша модель vs реальность 05/ Предсказанный вес Максимальный вес в этот день Средний вес в этот день Минимальный вес в этот день Вес в граммах День роста Проблемы, с которыми мы столкнулись 05/ Разметка данных Решение Временные затраты Мы учили нейросеть видеть контуры кустиков. Но салат вырастал, и они сливались Мы стали заключать кустики в прямоугольники. Маркировка ускорилась до 2 минут. На маркировку контуров на одном фото уходило до 15 минут. В чём ценность проекта 07/ Экология Экономия Растениям нужно меньше пестицидов и удобрений. Себестоимость салата ниже: уход частично автоматизирован. Команда проекта 08/ Техлид Константин Кубрак Computer Vision инженер Аэлита Шайхутдинова Менеджер проекта Надежда Загвозкина Бэкенд-разработчик Андрей Чертков Наши планы 06/ Автоматизировать сбор данных о растениях Начать обработку фото на месте, без отправки на сервер Использовать для съёмки растений дрон с камерой Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/zhivibezstraha-navyk-dlya-proverki-rodinok",
    "title": "Навык в Алиседля проверки родинок",
    "content": "En Главная / Портфолио / Навыки для голосовых ассистентов / Кейс «Живи без страха» Навык в Алисе для проверки родинок Социальный проект Основная информация 01/ Навык был создан в рамках социального проекта «Живи без страха». Его цель – побудить людей чаще проверяться на рак. Тема Меланома Вид навыка Тест с картинками Каждый год создатели проекта «Живи без страха» выбирают тип рака, о котором хотят рассказать. год они посвятили меланоме: профилактике, диагностике и лечению. Чтобы объяснить, как может выглядеть меланома, мы создали навык для голосового ассистента «Алиса». Он позволяет проверить свою родинку, отвечая на вопросы бота. Попробовать навык Узнать больше о проекте Алиса проверяет, похожа ли родинка на меланому . Если такие признаки есть, помогает записаться к врачу . Суть навыка: Алиса проверяет, похожа ли родинка на меланому . Если такие признаки есть, помогает записаться к врачу . Суть навыка: Схема работы навыка 02/ «Привет! Я помощник \"Проверь родинку\". Я помогу пройти самостоятельную оценку на возможные признаки меланомы». Алиса задает вопросы о внешнем виде родинки все пункты соответствуют норме хотя бы один пункт не соответствуют норме «Ура, у вас нет явных признаков меланомы. Но помните, что окончательный диагноз определяет врач» «Рекомендуем проверить и обследовать родинку. Вы можете записаться на обследование в рамках проекта \"Живи без страха\"» «Алиса, запусти навык \"Проверь родинку\"» Человек говорит: Человек выбирает ответ Программа запоминает все ответы Перейти к навыку Критерии оценки родинки 03/ Чтобы определить, опасна ли родинка, бот задаёт вопросы по схеме ABCDE ABCDE - аббревиатура, каждая буква которой указывает на признак меланомы: Чему мы научили Алису 04/ 01 оценивать возможные признаки меланомы отвечать на вопросы о меланоме записывать на бесплатное обследование к врачу EORA участвовала в проекте на благотворительных началах. Нам хотелось помочь другим людям, применив современные технологии и свои знания. Зачем это нам EORA участвовала в проекте на благотворитель-ных началах. Нам хотелось помочь другим людям, применив современные технологии и свои знания. Зачем это нам Трудности проекта 05/ Мы очень осторожно подбирали слова для этого навыка: Алиса не может ставить диагноз Работая над проектом, мы постоянно консультировались с врачами-онкологами Статья о навыке в Читать статью Статья о навыке в Читать статью К другим проектам Dialog Systems О нас писали в СМИ 06/ Статья о навыке в Статья о навыке в Статья о навыке в Статья о навыке в Статья о навыке в Читать статью Читать статью Читать статью Читать статью Читать статью Статья о навыке в Читать статью Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/sportrecs-nejroset-operator-sportivnyh-translyacij",
    "title": "Нейросеть, которая управляеттрансляцией матча",
    "content": "En Главная / Портфолио / Компьютерное зрение и ИИ / Кейс для «‎Sportrecs» Нейросеть, которая управляет трансляцией матча Основная информация 01/ Клиент Задача Sportrecs.com - российский стартап, сервис спортивных трансляций. Автоматизировать трансляцию матча, используя камеры с ИИ-управлением. Нейросеть ведёт трансляцию спортивных игр, следит за мячом и, когда нужно, переключается между камерами. Как это работает: Проблемы, с которыми мы столкнулись 02/ Нейросети сложно распознавать мяч, потому что на видео он нечёткий. 01 Для обучения алгоритма недостаточно данных. Для трансляции матча со смартфона нужны часы мобильного видео Для обработки нескольких видеопотоков нужно много вычислительных ресурсов Процесс разработки 03/ Нашли исходник Доработали Добавили функций Повысили надёжность Встроили в сервис Запустили в работу Взяли готовую нейросеть, которая умеет следить за большим мячом Обучили нейросеть «видеть» большие и маленькие мячи Добавили модель распознавания игроков в кадре Интегрировали нейросеть с сервисом Sportrecs. Подготовили систему к работе с четырьмя синхронными видеопотоками в реальном времени Как работает сервис 04/ В разных точках игрового поля устанавливают смартфоны На устройствах запускается стриминговый сервис Sportrecs Программа подключается к камерам смартфонов Каждые 5 секунд нейросеть переключает камеру, чтобы зритель не скучал Выбирает оптимальные планы, где хорошо видно мяч Демонстрационное видео 05/ Чему мы научились 06/ Обрабатывать несколько видеопотоков одновременно Делать нейросеть достаточно быстрой для режима live Демонстраци-онное видео Команда проекта 07/ Computer Vision инженер Менеджер проекта Backend-разработчик Специалист по MLOps Техлид Владислав Виноградов Андрей Чертков Константин Кубрак Аэлита Шайхутдинова Алексей Жучков 1 секунда видео - это 30 кадров, которые нейросеть должна обработать мгновенно . Интересный факт: Наши планы 08/ Научить нейросеть вести трансляцию в любых условиях, включая большие стадионы. Сейчас она умеет управлять показом игр в зале. Новые условия Научить нейросеть управлять видеокамерами на штативах и делать нарезку лучших моментов матча. Новые функции Новые виды спорта Виды спорта: баскетбол, волейбол, хоккей, бокс Эмоции от проекта 09/ Константин Кубрак Менеджер проекта (Разбил мячом окно во время тестов) «99,9% населения Земли не знают о нейросетях того, что сейчас знаем мы». «Узнавая, как работают нейросети, мы заодно познаём себя» Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/avon-chat-bot-dlya-zhenshchin",
    "title": "Чат-бот, помогающий женщинам подобрать подарки для мужчин",
    "content": "En Главная / Портфолио / Разработка чат-ботов / Кейс для «AVON» Чат-бот, помогающий женщинам подобрать подарки для мужчин Анализ изображений О ПРОЕКТЕ О ПРОЕКТЕ О ПРОЕКТЕ Предложить проект О ПРОЕКТЕ Основная информация 01/ Заказчик Создать подборщик подарков через «Вконтакте» Задача Функция бота Девушка загружает в чат-бот фотографию мужчины Проект в рамках рекламной кампании Avon к 23 февраля Аудитория Девушки лет О проекте Бот помогает с выбором подарка в зависимости от типажа мужчины Персонаж проекта 02/ В рамках проекта шоумен Тимур Родригез примерил на себя роль профессионального переводчика с мужского на русский. «Привет! Я Тимур Родригез. Я профессионально перевожу с «мужского» на русский. И помогу тебе выбрать лучший подарок для твоего мужчины» После того, как девушка загружала фотографию мужчины, бот от лица Тимура давал шуточные комментарии: Чат-бот раздавал оригинальные идеи подарков, основываясь на полученных данных о конкретном мужчине искусственный интеллект с Тимуром Родригезом Команда проекта 03/ Владислав Виноградов Техлид Чат-бот разработчик Роман Афанасьев Менеджер проекта Эмиль Магеррамов Data Scientist Рамиль Гиззатулин Константин Кубрак Computer Vision Инженер Длительность разработки 04/ Интеграция Разметка Валидация 10.2% 13.6% 20.3% Предобработка 10.2% Тестирование 8.1% Деплой 5.1% Обучение 32.5% Итого: 3.5 месяца работы Для анализа изображений используется семь нейросетевых моделей Интересный факт Схема работы 05/ Девушка загружает в чат-бот фотографию мужчины Нейросеть анализирует фотографию по параметрам: 01 Тип одежды 02 Тип фигуры Цвет волос 03 Тип растительности на лице и голове 04 Нейросеть создает маску сегментации: русый усы щетина худой бизнес В зависимости от полученных параметров, мужчине на фото приписывается один из четырех типажей : Брутал Домосед Метросексуал Непоседа Каждому типажу соответсутвует свой рекомендуемый подарок — косметическое средство Avon Инструменты 06/ Для создания бота мы использовали собственные сервисы: Простая и удобная платформа для разработки чат-ботов, голосовых ассистентов и систем автоматизации контакт-центров. zDialog ИИ-сервис аналитики чат-ботов. Позволяет проводить более глубокий анализ диалогов «человек-робот» и получать более точную оценку эффективности бота. OneDash Перейти к zDialog Перейти к OneDash Мы создаем хостинговую платформу для исполнения моделей компьютерного зрения на любом устройстве. Модели исполняются на наших серверах и доступны по REST API Vision Hub Перейти к Vision Hub Немного статистики 07/ фотографий аудио За время кампании было загружено сообщения Техническая реализация 08/ выявление пола человека 01 Так как проект был рассчитан только на мужчин, нужно было научить нейросеть определять пол. Для этого мы взяли большой набор данных, состоящий из фотографий людей с указанием пола. Для увеличения точности мы использовали нейросеть dlib , которая детектировала на фото лицо. анализ одежды 02 Для анализа одежды мы также использовали модель сегментации, то есть выделения одежды, а дальше присваивали ей один из пяти классов: Кроме этого нужно было научить нейросеть находить обнаженные фото, т.е. отсутствие одежды на фото. casual спортивная одежда военная форма деловая одежда экстремальная экипировка анализ фигуры 03 Для того, чтобы определять типаж человека на фото более точно, нужно было обучить нейросеть распознавать фигуру. Мы решили взять два основных параметра - научиться понимать комплекцию человека и его примерный вес. Так мы смогли отделять четыре класса: худой полный нормальный мускулистый анализ зон растительности на лице и цвета волос 04 Для начала нужно было определить тип растительности по зонам или ее отсутствие, а дальше определить цвет волос/бороды. Для этого нам также понадобился детектор лица, а следующим шагом мы использовали предобученную модель Tiramisu и набор правил, чтобы детекция была более точной. После этого нужно было определить цвет волос: анализ фона 05 Последней задачей была классификация фона — нужно было попробовать определить место съемки или характерные приметы, такие как море, машина и так далее. Из-за низкого качества реальных данных результат получался не очень точным, поэтому в итоговой модели практически не учитывался . Еще более подробную презентацию проекта можно посмотреть здесь Презентация Трудности проекта 09/ Константин Кубрак Computer Vision Инженер «Как ни странно, трудностей почти не было. Сложнее всего было классифицировать фон. Мы очень долго с ним возились, но в результате просто решили убрать – оказалось, что остальных параметров достаточно». Результаты проекта 10/ Было интересно и драйвово, потому что многие вещи были в новинку: К другим проектам Dialog Systems Первый чат-бот, где используется машинное зрение Пайплайн из семи нейросетей внутри одного проекта Первые попытки анализировать звук Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/navyki-dlya-golosovyh-assistentov/navyk-dlya-proverki-loterejnyh-biletov",
    "title": "Навык для проверки лотерейных билетов",
    "content": "En Главная / Портфолио / Навыки для голосовых ассистентов / Кейс для «‎Столото» Навык для проверки лотерейных билетов Навык в Алисе Что хотел клиент? 01/ Упростить проверку лотерейных билетов Сделать лотерею современной и удобной Чему мы научили помощника «Столото» 02/ 01 Проверка билетов Помощь в покупке билетов 02 Ответы на вопросы о лотерее 03 Как работает помощник «Столото» 03/ Пользователь говорит: Отвечаем на вопросы задает вопрос проверяет билет Связываемся с базой данных «Столото» выиграл не выиграл Находим ближайшую точку выдачи призов просим оставить отзыв просим оставить отзыв Отправляем отзыв на проверку «В следующий раз повезет!» Перейти к навыку «Алиса, запусти навык \"Столото\"» Как работает помощник «Столото» 03/ Перейти к навыку Пользователь говорит: Связываемся с базой данных \"Столото\" Отвечаем на вопросы Смотрим, где ближайшая точка выдачи призов просим оставить отзыв Отправляем отзыв на анализ «В следующий раз повезет!» проверяет билет задает вопрос не выиграл выиграл «Алиса, запусти навык \"Столото\"» Немного статистики 04/ в месяц 10к - 15к 16к в день Среднее количество пользователей помощника «Столото» в обычные дни Среднее количество пользователей помощника «Столото» во время крупных розыгрышей Проблемы, с которыми мы столкнулись 05/ 01 Причина Пользователи не успевали продиктовать номер билета целиком Следствие Робот отправлял в базу данных «Столото» неполный ряд цифр. Система «Столото» выдавала ошибку в ответ на запрос Решение Мы научили Алису переспрашивать номер билета 02 Причина Проигравшие пользователи ставили навыку низкую оценку Следствие Навык «Столото» занимал низкие позиции, им мало пользовались Решение Мы научили Алису запрашивать обратную связь. Если отзыв хороший, просили оценить навык. Если отзыв плохой, выясняли, в чём дело Ошибки при проверке лотерейных билетов через Алису Низкий рейтинг у навыка «Столото» в каталоге Алисы Интересные факты 06/ Это наш самый популярный навык в Алисе Люди часто спрашивают «Как стать миллионером?» Пользователи, не выигравшие в лотерею, низко оценивают навык Этот проект вдохновил нас на создание платформы для разработки ботов zDialog Перейти к zDialog Эмоции от проекта 07/ Здорово, что даже при очень больших нагрузках (в новогодние праздники, в период крупных розыгрышей) ничего не ломается, навык продолжает работать. Сергей Веренцов Сергей Пономаренко Менеджер проекта, контролирует всё и вся (почти) Разработчик, больше всех топал ногами Приятно, что мы создали действительно полезный инструмент, которым люди регулярно пользуются. Что дальше? 08/ Поддержка навыка Добавление новых функций Подключение навыка на других платформах К другим проектам Dialog Systems Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/computer-vision/iss-analiz-foto-avtomobilej",
    "title": "Система обнаружения посторонних предметов на днищах автомобилей с помощью нейросети",
    "content": "En Главная / Портфолио / Компьютерное зрение и ИИ / Кейс для «ISS» Система обнаружения посторонних предметов на днищах автомобилей с помощью нейросети Анализ изображений Основная информация Заказчик ISS — Интеллектуальные Системы Безопасности — компания-интегратор решений по безопасности Продукт Задача Программное обеспечение для стендов проверки автомобиля — днище осматривается человеком с помощью зеркал и по фотографиям Найти аномальные предметы на дне автомобиля по фотографии Где используется: на военных объектах Зачем нужно: на приграничных постах в местах с повышенными требованиями к безопасности автоматизировать процесс проверки ускорить работу оператора Как это работает Машина заезжает на стенд Осуществляется фото-съемка днища автомобиля При нахождении аномалий показывает снимок оператору Нейросеть анализирует снимок Аномалия Техническая реализация Провели ML-аудит Так как подобные задачи практически не решались, наш клиент заказал услугу ML-аудита Нашли научную статью В результате исследования мы нашли научную статью по похожей тематике Узнать больше о ML-аудите Модель Мы воспроизвели статью и адаптировали модель под наши данные VisionHub Как интерфейс визуализации мы использовали наш хостинг моделей машинного зрения VisionHub Перейти к Vision Hub GAN Основной метод — генеративно- состязательные сети (GAN), алгоритм машинного обучения. Принцип работы: Шаг 01 Запоминаем, как выглядит объект в нормальном состоянии Шаг 02 Генерируем изображения и фиксируем на них аномалии Зафиксирована аномалия Процесс разработки Входные данные изображений днищ автомобилей с аномалиями эталонных изображений днища Обработка датасета Разметили вручную изображения, отметили аномалии. изображения с аномалией нормальных Разрезали фотографии на квадратики по пикселей и отсматривали отдельно. аномальных нормальных Обучение модели Обучили модель на подготовленной выборке. Точность метрики качества составила 0.73 Очень маленький датасет, недостаточный для качественного обучения нейронной сети Изображения в большом разрешении — 4 тыс. на 10 тыс. пикселей Метрика - соотношение корректно определенных аномалий и ложно определенных Аномалия: есть/нет на этом фрагменте. Не стояло задачи точно локализовать. Этапы разработки Согласование Аудит Начало разработки 1, месяца 2 недели Текущие результаты Завершился этап аудита Удалось построить первую модель Готовимся к большому проекту Команда проекта Михаил Евдокимов Менеджер Техлид Влад Виноградов Computer Vision инженер Аэлита Шайхутдинова Особенности проекта Впервые использовали GAN в продакшене Один из первых наших аудитов Впервые работаем с компанией- интегратором и вообще с людьми, которые связаны с разработкой весьма опосредованно Где могут пригодиться наработки Например, в медицинских приложениях В системах, где нужно обнаружить отклонение от нормы Трудности проекта Непривычный материал Cложности коммуникации, так как компания очень большая Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/purina-master-bot",
    "title": "Универсальный бот для сайтов Purina, которого можно постоянно обучать",
    "content": "En Главная / Портфолио / Разработка чат-ботов / Кейс для «Purina»‎. Мастер-бот Мастер-бот Универсальный бот для сайтов Purina, которого можно постоянно обучать Заказчик Задача Purina - дочерняя компания Nestle, производитель кормов для домашних животных. Сделать виджет для основного сайта и промо-страниц Purina, чтобы снизить нагрузку на контакт-центр во время проведения рекламных акций. Суть чат-бота Мастер-бот, который отвечает на вопросы об акции и продукте, загружает чеки и принимает промокоды. Мастер-бот умеет больше, чем обычный чат-бот регистрировать участников проводить викторину отвечать на вопросы из списка FAQ записывать сообщения об ошибках В мастер-бота можно добавлять сценарии и данные, адаптировать его под новые промо-акции. «Благодаря боту нагрузка на хотлайн уменьшилась в десятки раз». Purina Процесс разработки Шаг 01 Создаем сценарии диалогов «человек-бот» Шаг 02 Загружаем контент из базы знаний Шаг 03 Добавляем чат-бота на сайты заказчика Запускаем чат-бота в полноценном режиме Шаг 06 Шаг 05 Делаем отладку, обновляем базу знаний Шаг 04 Тестируем сервис, собираем статистику Технологии Для разработки этого навыка мы использовали собственные сервисы EORA zDialog OneDash Простая и удобная платформа для разработки чат-ботов, голосовых ассистентов и систем автоматизации контакт-центров. ИИ-сервис для оценки эффективности чат-ботов и глубокого анализа диалогов «человек - бот». Перейти к zDialog Перейти к OneDash Команда проекта Разработчик Антон Капридов Технический директор Сергей Веренцов Менеджер Антон Шипов Разработчик Алексей Шерченков Другие проекты с Nestlé Навык в Алисе Викторина с вопросами об уходе за кошками. Перейти к проекту Purina One Чат-бот, который помогает перевести собаку на новый корм. Перейти к проекту Purina Friskies «Умный» чат-бот: отвечает на FAQ, загружает чеки, регистрирует. Перейти к проекту Итоги Чат-бот успешно «отработал» первую промо-акцию. Мы обновили сервис и запустили в рамках второй промо-акции. Благодаря мастер-боту новые акции обходятся дешевле: бота нужно обновлять, а не создавать каждый раз заново. Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/skinclub-algoritm-dlya-ocenki-veroyatnostej",
    "title": "Модель, позволяющая подобрать оптимальную вероятность выпадения скинов из лутбоксов",
    "content": "En Главная / Портфолио / Компьютерное зрение и ИИ / Кейс для «SkinClub» Модель, позволяющая подобрать оптимальную вероятность выпадения скинов из лутбоксов Data Science Лутбокс (англ. loot box, коробка добычи) — виртуальный контейнер в компьютерных играх, в котором находятся предметы разной ценности и назначения. Скин (англ. skin, кожа) — виртуальное изменение внешнего вида игрока, оружия или других элементов в игре. Клиент: магазин скинов и лутбоксов Основная информация Как это работает На сайте заказчика есть сундучок Пользователь: покупает сундучок открывает его выигрывает приз – скин из игры Особенности Механика открытия лутбоксов похожа на лотерею – игрок никогда не знает, что именно он получит и будет ли это стоить потраченных денег. Сейчас коэффициенты вероятности подбираются с помощью алгоритма, который работает медленно . Наша задача Разработать систему, которая бы автоматически подбирала коэффициенты вероятности Условная схема виртуальный сундучок с подарками Лутбокс: Стоимость открытия: рублей Для каждого сундучка задается: набор предметов, которые могут из него выпасть вероятность выпадения этих предметов Вероятность выпадения скинов: «‎Подарок 1» стоимость 50 рублей Вероятность: «‎Подарок 2» стоимость рублей Вероятность: У пользователя есть шанс выиграть приз дороже самого лутбокса Наша задача: так настроить коэффициенты, чтобы пользователю было интересно , а заказчику выгодно : дорогие подарки — не слишком маленькая вероятность выпадения дешевые подарки — максимальная вероятность выпадения В итоге: Игрок сохраняет азарт Заказчик работает в плюс Исходные данные: Что мы сделали Гистограмма распределения шансов выпадания предметов в лутбоксе Команда проекта Менеджер проекта Константин Кубрак Аналитик данных Олег Дурыгин Интересный факт Это международный проект, мы получили опыт работы с компанией из Шотландии Трудности проекта специфичность предметной области очень много математики Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/skolkovo-chat-bot-dlya-startapov-i-investorov",
    "title": "Чат-бот, который знакомит инвесторови резидентов «Сколково»",
    "content": "En Главная / Портфолио / Разработка чат-ботов / Кейс для «Skolkovo» Чат-бот, который знакомит инвесторов и резидентов «Сколково» Чат-бот в Telegram Клиент «Сколково» - инновационный центр. «Сколково» хотели простой инструмент, который собирает контакты 01/ Он поддерживает развитие ИТ-компаний в России, помогает им находить инвесторов, выходить на новые рынки. Задача 02/ интересных разработчиков инвесторов предпринимателей чтобы знакомить их и приглашать в технопарк. Чат-бот предлагает инвесторам контакты в стартапах, которые отвечают ряду параметров. Так же он работает с владельцами стартапов, которым нужен инвестор. Суть проекта Трудности проекта 03/ Мы хотели использовать базу контактов из CRM «Сколково», но не смогли с ней интегрироваться. Поэтому развернули новую базу на серверах фонда. В Telegram сложно создать простой и понятный интерфейс, используя только внутренние инструменты. Платформа EORA zDialog для разработки чат-ботов и голосовых помощников. Она легко интегрируется с Telegram и даёт больше возможностей. Проблема Проблема Решение Решение Как работает чат-бот 04/ Пользователь отправляет заявку боту Заявка проходит модерацию Пользователь указывает, какие сферы и знакомства ему интересны По выбранным тегам бот осуществляет поиск и предлагает людей, которые могут быть интересны Пользователь выбирает нужные контакты Как выглядит чат-бот 05/ Пользователь пишет боту. Бот просит указать номер телефона Пользователь выбирает сферу интересов и с кем бы хотел познакомиться Бот предлагает людей, которые могли бы быть интересны Разработка 06/ проектирование программирование тестирование версионирование Мы стремимся форсировать разработку и тестирование, чтобы люди скорее начали пользоваться ботом. Фидбек от пользователей- ключ к созданию действительно удобного сервиса. Интересные факты 07/ Наш бот понимает обычный, естественный язык. Пользователю не нужно как-то по-особенному формулировать запросы. Это возможно благодаря технологиям платформы EORA zDialog. Проект предусматривал сложные сценарии взаимодействия между человеком и ботом, а также несколькими пользователями одновременно. Эту опцию удалось реализовать на платформе EORA zDialog. Telegram - самый популярный мессенджер среди резидентов «Сколково» несмотря на его длительную блокировку. Чат-бот в нём подходил большинству стартаперов. Технологии 08/ Для разработки этого навыка мы использовали два наших продукта Простая и удобная платформа для разработки чат-ботов, голосовых ассистентов и систем автоматизации контакт-центров. zDialog ИИ-сервис аналитики чат-ботов. Позволяет проводить более глубокий анализ диалогов «человек-робот» и получать более точную оценку эффективности бота. OneDash Перейти к zDialog Перейти к OneDash Команда проекта 09/ Разработчик диалоговых систем Cоучредитель EORA Dialog Systems Сергей Пономаренко Ильгизар Мурзаков Наши планы 10/ Сделать чат-бота «Сколково» медиа: рассылать анонсы мероприятий, расписания конференций и митапов. Добавить функцию поиска людей через геолокацию «люди рядом» . Менеджер Антон Шипов Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/purina-podbor-korma-dlya-sobaki",
    "title": "Чат-бот определяетпороду собаки по фотои даёт советы по питанию",
    "content": "En Главная / Портфолио / Разработка чат-ботов / Кейс для «Purina». Чат-бот Чат-бот определяет породу собаки по фото и даёт советы по питанию Чат-бот «ВКонтакте» Клиент Purina - дочерняя компания Nestle, производитель кормов для домашних животных. Задача Сделать чат-бота «ВКонтакте» для участников программы Purina «21 день», который поможет владельцам собак перевести питомцев на новый корм, оценить качество питания. Бот подсказывает, как кормить собаку, даёт советы и скидки, информирует, поддерживает интерес к программе. Процесс разработки 01/ Шаг 01 Изучили базу знаний контакт-центра Purina, отобрали популярные запросы. Шаг 02 Шаг 03 Шаг 04 Интегрировали чат-бота «ВКонтакте» с CRM-системой Purina. Шаг 05 Шаг 06 Провели тестирование, сделали отладку. Подключили чат- бота, запустили промо. Составили сценарии по матрице рекомендаций продуктов Purina. Интегрировали нейросеть, распознающую породу, с чат-ботом. Ключевые функции 02/ Распознаёт породу собаки по фото Регулярно спрашивает о здоровье собаки Даёт советы по e-mail и в push-уведомлениях Принцип работы чат-бота 03/ Пользователь пишет боту «Участвовать», указывает свои имя и e-mail Бот отправляет на#nsbp;e-mail купон на#nsbp;скидку при покупке корма Пользователь загружает фото своей собаки Бот определяет породу животного, уточняет возраст и кличку Пользователь подтверждает, что хочет участвовать в промо-программе Бот предлагает программу питания для собаки, подключает к рассылке Технологии 04/ Для разработки этого навыка мы использовали два наших продукта Простая и удобная платформа для разработки чат- ботов, голосовых ассистентов и систем автоматизации контакт-центров. zDialog ИИ-сервис аналитики чат-ботов. Позволяет проводить более глубокий анализ диалогов «человек-робот» и получать более точную оценку эффективности бота. OneDash Перейти к zDialog Перейти к OneDash Интересные факты 05/ Программы питания для собак варьируются в зависимости от их породы и возраста. Рекомендации по питанию и советы для рассылки дали специалисты Purina. Мы научили чат-бота отвечать на вопросы покупателей Purina. Для этого мы использовали базу знаний контакт-центра компании. Немного статистики 06/ человек присоединились к программе за месяц человек подписались на рассылку от Purina Если бот не знает ответа, предлагает переключить пользователя на оператора. Итоги 07/ С чат-бота для Purina ONE началось наше сотрудничество с Nestle: Перейти к проекту Перейти к проекту Перейти к проекту С вопросами об уходе за кошками. Универсальный чат-бот для промо-страниц и основного сайтаPurina. «Умный» чат-бот: отвечает на FAQ, загружает чеки, регистрирует. Purina викторина Purina мастер-бот Purina Friskies Команда проекта 08/ Менеджер Разработчик Технический директор Антон Шипов Сергей Веренцов Антон Капридов Наши планы 09/ Запускать новые рекламные компании с интересными механиками Добавить в базу знаний бота информацию о кошках Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/purina-navyk-viktorina",
    "title": "Викторина с вопросамиоб уходе за кошками",
    "content": "En Главная / Портфолио / Навыки для голосовых ассистентов / Кейс для «Purina». Навык в Алисе Викторина с вопросами об уходе за кошками Навык в Алисе Основная информация 01/ Заказчики Mindshare, Nestle Задачи Разработать викторину в Алисе, чтобы повысить доверие покупателей; Аудитория Владельцы кошек и собак Человек узнает об акции из СМИ Переходит в Алису Проходит тест Получает промокод на скидку Человек счастлив Прорекламировать корм Чтобы получить промокод на скидку в «Магните», нужно правильно ответить на вопросы викторины и оставить свой email Суть квиза: Процесс разработки 02/ подготовительный этап основной этап Шаг 01 Изучаем материалы от клиента Проектируем сценарий Пишем тексты Озвучиваем Шаг 02 Шаг 03 Шаг 04 Передаем в разработку Разрабатываем бота на своей платформе zDialog Шаг 05 Шаг 06 Модерируем Шаг 07 Тестируем вместе с клиентом Шаг 08 Запускаем Перейти к zDialog Схема работы навыка 03/ Привет. Я подготовила для вас несколько вопросов, чтобы узнать, насколько хорошо вы знаете свою кошку. Пользователь проходит тест все ответы правильные есть неправильные ответы Вашей кошке очень повезло с таким хозяином, как вы. Оставьте, пожалуйста, свою почту, чтобы вам выслали сертификат на скидку. Не отчаивайтесь. Я обязательно придумаю что-нибудь новенькое, чтобы вы оказались в списке победителей. До новых встреч! Не отчаивайтесь. Я обязательно придумаю что-нибудь новенькое, чтобы вы оказались в списке победителей. Интересный факт 04/ После успешной реализации этого навыка у нас появились новые проекты с Nestlé: Purina One Purina Friskies Чат-бот, помогающий перевести собаку на корм Purina ONE Виджет на сайт, через который проходит вся коммуникация и целевые действия пользователей Перейти к кейсу Перейти к кейсу Команда проекта 05/ Сергей Пономаренко Менеджер Разработчик Антон Капридов Аналитик / дизайнер диалогов Анна Михник Квизы – это всегда весело , но совершенно неожиданно, что такая акция была в Алисе. Мне понравилось ! Цитата пользователя навыка: Виктория Квизы – это всегда весело, но совершенно неожиданно, что такая акция была в Алисе. Мне понравилось! Результаты проекта 06/ Мы научились быстрее делать викторины. Теперь на их разработку мы тратим неделю, а не месяц Мы стали больше работать с клиентами из FMCG Викторины стали популярнее среди компаний, которые занимаются товарами широкого потребления К другим проектам Dialog Systems Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/dodo-pizza-pilot-po-avtomatizacii-kontakt-centra",
    "title": "Пилот по автоматизации контактного центра «ДОДО пиццы»",
    "content": "En Главная / Портфолио / Автоматизация контакт-центров / Кейс для «Додо Пицца». Пилот Бот для телефонии Пилот по автоматизации контактного центра «ДОДО пиццы» «Додо Пицца» - сеть пиццерий, одна из крупнейших сетей общепита в России. Автоматизировать обработку части звонков в контакт-центр «Додо Пиццы». Клиент Задача Решение Бот, который понимает, что говорят клиенты, и помогает им по мере возможности. Предложить проект Презентация сервиса для «Додо» на конференции Conversations в ноябре года. Что умеет наш бот 01/ Отвечать на вопросы клиентов, которые уже сделали заказ. Вносить изменения в заказ, если это возможно. Переключать на оператора, если не может помочь. Бот предупреждает оператора и передаёт ему информацию о звонке Если клиент просит переключить на менеджера пиццерии, бот сначала повторяет менеджеру первую фразу клиента. Основные навыки Дополнительные навыки Тематики звонков 02/ 15% 20% 35% 30% вопросы о зоне доставки вопросы о текущих заказах другие вопросы вопросы о пиццериях Обращения, которые бот научился обрабатывать 03/ Жалоба на опоздание курьера Желание изменить способ оплаты Изменение способа доставки Отмена заказа Жалоба на качество продукции Как работает голосовой бот Клиент звонит в «Додо Пиццу» и попадает на робота Бот транскрибирует ответ клиента и изучает полученный текст Dodo IS передаёт боту данные о клиенте (если он уже делал заказ) На основе этих данных бот определяет тему обращения Система отвечает человеку голосом или связывает с оператором Клиент доволен! 04/ Интересный факт «Соедините с императором » Фраза, которая «ломала» систему бота «Додо» из-за ошибки в распознавании речи. Общая схема автоматизации КЦ 05/ Телефония Сhatbot engine Телефония Голосовое меню Speech2Text Dodo IS API Классификатор интента Бот-скрипт Text2Speech Оператор Клиент Клиент Мы запустили бота для «Додо» в рамках пилота , немного «сырым». Мы улучшаем сервис в процессе, анализируя диалоги между ботом и реальными клиентами. Процесс разработки бота 06/ Изучили руководства для операторов контакт-центра Прослушали записи более разговоров «оператор-клиент» Структурировали данные, собрали статистику Составили классификатор интентов - тем звонков Проработали сценарии диалогов «клиент - бот» Интегрировались с Dodo IS * и телефонией заказчика Шаг 01 Шаг 02 Шаг 03 Шаг 05 Шаг 06 Шаг 07 Выделили темы разговоров, которые нужно было автоматизировать Шаг 04 подготовительный этап основной этап Передали в разработку *Dodo IS - информационная система «Додо Пиццы», которая поддерживает сайт и приложение «Додо». В ней работают франчайзи, операторы контакт-центра. Экономика 07/ % минуты рублей в минуту звонков в месяц средняя длительность разговора клиента с оператором средняя стоимость работы оператора контакт-центра работы контакт-центра реально можно автоматизировать поступают в контакт-центр «Додо Пиццы» > рублей в месяц Итого экономия «Додо Пиццы» в рамках пилотного проекта. Инструменты 08/ В работе мы использовали следующие сервисы: Простая и удобная платформа для разработки чат-ботов, голосовых ассистентов и систем автоматизации контакт-центров. ИИ-сервис аналитики чат-ботов, даёт детализированную оценку их эффективности. zDialog OneDash Перейти к OneDash Перейти к zDialog Трудности проекта 09/ Проблема Проблема Проблема Решение Решение Решение Мы ничего не знали о работе контакт-центра. Не было данных для обучения чат-бота. Мы не транскрибировали записанные разговоры, чтобы не тратить время и деньги. Пока мы работали над проектом, некоторые темы обращений стали неактуальными. Бот делал ошибки при распознавании речи в 46% случаев. Проблема Решение Мы обновили базу знаний бота. Мы заменили платформу распознавания голоса и остановились на Yandex SpeechKit. Мы использовали типичные фразы, которые говорят клиенты. Их написали операторы контакт-центра. Чтобы снизить риск ошибки, запросили у «Додо» максимум информации. Цитаты 10/ «У нас была большая компетенция в разработке чат-ботов, но мы представления не имели, как работает контакт-центр». Алексей Медведовский лидер ИТ-направления контакт-центра «Додо Пиццы» «До знакомства с EORA мы понятия не имели, что такое чат-боты и искусственный интеллект». CEO «EORA» О нас писали СМИ 11/ Читать статью Читать статью Результаты 12/ В рамках пилотного проекта бот научился успешно проводить и завершать звонок распознавать тему обращения в 67% 97% случаев случаев из них Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/dodo-pizza-avtomatizaciya-kontakt-centra",
    "title": "Бот на миллион:как мы автоматизироваликонтакт-центр «Додо Пиццы»",
    "content": "En Главная / Портфолио / Автоматизация контакт-центров / Кейс для «Додо Пицца» Бот на миллион: как мы автоматизировали контакт-центр «Додо Пиццы» Бот для телефонии «Додо Пицца» - сеть пиццерий, одна из крупнейших сетей общепита в России. «Разгрузить» контакт-центр «Додо Пиццы» с помощью голосового бота. Клиент Задача Предыстория В году мы с «Додо» запустили пилотный проект: голосового бота, который отвечал на звонки определённой тематики в «Додо Пиццу» Заказчик остался доволен сервисом и решил расширить спектр обращений, которые бот смог бы обрабатывать. Перейти к пилотному проекту Сначала бот принимал только звонки пользователей, оформивших заказ. Чтобы он быстрее «изучил» другие темы, мы стали переводить на бота все звонки. Какие звонки обрабатывает бот 01/ Бот уже знает Бот изучает жалоба на опоздание курьера жалоба на качество продукции изменение способа доставки отмена заказа минимальная сумма заказа время приготовления заказа график работы наличие детской комнаты адрес Дополнительные функции 02/ Бот уведомляет о работе пиццерии в праздничные дни. Если звонит клиент, сделавший заказ, бот сначала сообщает статус заказа. Сообщение включается и отключается автоматически, в привязке к календарю. Раньше «Додо» добавляли его «вручную». Затем бот спрашивает, чем ещё может помочь (к примеру, дать справку о графике работы). Интересный факт Чтобы бот лучше распознавал тему обращения, мы использовали самых популярных реплик и ещё реплик из случайной выборки. Процесс разработки 03/ Запустили чат-бота в пилотном режиме Собрали статистику о его работе Запустили чат-бота в «боевом» режиме Проанализировали диалоги «бот-человек» Добавили новые сценарии диалогов Сделали отладку, запустили бота в работу Шаг 01 Шаг 02 Шаг 03 Шаг 04 Шаг 05 Шаг 06 Чтобы ускорить разработку и отладку, мы перешли на собственные сервисы. С платформой zDialog от EORA получается делать более тонкую настройку сервиса. К примеру, включать информатор только в канун праздников. Перейти к zDialog Инструменты 04/ В работе мы использовали следующие сервисы: Простая и удобная платформа для разработки чат-ботов, голосовых ассистентов и систем автоматизации контакт-центров. ИИ-сервис аналитики чат-ботов, даёт детализированную оценку их эффективности. zDialog OneDash Перейти к Yandex SpeechKit Перейти к OneDash Yandex SpeechKit Технология распознавания и синтеза речи от компании «Яндекс» Перейти к zDialog Команда проекта 05/ Менеджер проекта Редактор сценариев Технический директор Разработчик Аналитик Разработчик Сергей Пономаренко Сергей Веренцов Алексей Шерченков Анна Михник Антон Капридов Татьяна Попова Эмоции от проекта 06/ «Проект крутой, потому что, во-первых, заказчик крупный и у него много данных. Во-вторых, мы сразу можем показать результат: человек, который звонит в «Додо», говорит с нашим ботом». Сергей Веренцов Менеджер проекта Статистика 07/ звонков в месяц обрабатывает бот в «боевом» режиме точность распознавания темы обращения в рамках пилота рублей в месяц экономия от бота в «боевом» режиме ~% > Цитата «Самые свежие данные: ваш бот распознаёт тему в 85% случаев. Не знаю, как вы это сделали, но это офигенный результат!» Алексей Медведовский Лидер ИТ-направления контакт-центра «Додо Пиццы» Планы 08/ В «Додо» появится отдельная группа операторов, которые работают с жалобами. Мы хотим научить бота распознавать жалобу на заказ и переключать на оператора. Скоро в приложении «Додо» можно будет видеть местоположение курьера и расчётное время доставки. Наш бот будет сообщать эту информацию при звонке в контакт-центр. Список тем, которые сможет отрабатывать бот, ещё расширится. Сейчас мы утверждаем их. Другие проекты для «Додо» 09/ Автоматизация контакт-центра «Додо Пиццы». Пилот Робот для анализа отзывов в мобильном приложении «Додо» К проекту К проекту Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/icl-bot-sufler-dlya-kontakt-centra",
    "title": "Бот-справочник, суфлирующий операторам контакт-центра",
    "content": "En Главная / Портфолио / Автоматизация контакт-центров / Кейс для «ICL»‎ Бот-справочник, суфлирующий операторам контакт-центра Виджет на сайте Основная информация 01/ Клиенты Разработчик ИТ-сервисов для бизнеса Задачи Сделать виджет для сайта энергокомпании, чтобы автоматически отвечать на некоторые вопросы клиентов и «разгружать» контакт-центр Аудитория Бизнес и обычные люди, которые пользуются электричеством Крупнейшая электросетевая компания Татарстана «Умный» бот, который отвечает пользователям на сайте клиента Объект разработки Процесс разработки бота 02/ подготовительный этап основной этап Шаг 01 Изучаем материалы от клиента Шаг 02 Шаг 03 Шаг 04 Передаем в разработку Разрабатываем бота на своей платформе zDialog Шаг 05 Шаг 06 Интегрируем решение с программой заказчика Шаг 07 Проводим совместное тестирование Запускаем, делаем отладку Перейти к zDialog Проектируем архитектуру программы Разрабатываем сценарии и базу знаний Инструменты 03/ Для создания бота мы использовали собственные сервисы: Простая и удобная платформа для разработки чат-ботов, голосовых ассистентов и систем автоматизации контакт-центров. zDialog ИИ-сервис аналитики чат-ботов. Позволяет проводить более глубокий анализ диалогов «человек-робот» и получать более точную оценку эффективности бота. OneDash Перейти к zDialog Перейти к OneDash Схема работы 04/ Бот ищет ответ в базе знаний Дает справку Переводит на оператора работа бота находит ответ не находит ответ Клиент не ждет, клиент доволен Клиент задает вопрос на сайте Как выглядит виджет 05/ Бот запускается в диалоговом окне на сайте клиента Представляется и предлагает кнопки-подсказки Бот распознаёт вопрос пользователя и отправляет ответ Смотреть виджет на сайте компании База данных бота 06/ 01 Бот ищет ответы на вопросы в базе знаний и перенаправляет пользователя на оператора, если не может ответить сам. Мы добавили их, чтобы облегчить работу операторам Ключевые навыки Дополнительные навыки Когда в чате с пользователем общается человек, бот работает в режиме суфлера и предлагает оператору варианты ответа. Бот «учится»: операторы могут добавлять в базу знаний новые вопросы и ответы. Мы добавили дополнительные навыки, чтобы облегчить работу операторам Мы добавили дополнительные навыки, чтобы облегчить работу операторам Демо-версию проекта мы показали президенту Татарстана Интересный факт Команда проекта 07/ Иван Старков Руководитель проекта Разработчик Антон Капридов Технический директор Сергей Веренцов Аналитик и QA-тестировщик Анна Михник Разработчик Алексей Шерченков «Проект занял девять месяцев – можно сказать, рожали, как дитя» Цитата Иван Старков Менеджер проекта Трудности проекта 08/ 01 В базе знаний очень много информации. Чтобы сделать бота «умным», мы обработали массу текстов. 02 Базу надо постоянно обновлять. Для этого мы добавили опцию «обучения» бота. Результаты проекта 09/ Это наша первая программа, в которой с пользователем могут одновременно общаться и бот, и человек. Мы сильно \"прокачали\" виджет ещё во время работы над проектом. Он научился отправлять пользователю сообщения вместо оператора. Мы успешно интегрировались с внутренними системами заказчика ICL, поэтому без труда вносили изменения в проект во время работы. К другим проектам Dialog Systems Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/s7-navyk-dlya-podbora-aviabiletov",
    "title": "Навык для Алисыи чат-бот, который подбирает авиабилеты",
    "content": "En Главная / Портфолио / Навыки для голосовых ассистентов / Кейс для «S7» Навык для Алисы и чат-бот, который подбирает авиабилеты Презентация навыка на Yet another Conference от Яндекса 02/ Кто заказчик? S7 Airlines Крупнейшая частная авиакомпания в России 03/ Задачи, которые мы решали Сделать чат-бота для бронирования билетов на рейсы S7 в Facebook. Создать аналогичный навык для голосового ассистента Яндекс.Алиса. 04/ Проблемы, с которыми мы столкнулись Отсутствие инструментов Решение Нет опции покупки прямо в Алисе Решение Нетерпеливая Алиса Требования Facebook Решение Когда мы делали навык для Алисы, платформа «Яндекс.Диалоги» для сторонних разработчиков ещё только создавалась Мы активно сотрудничали с разработкой «Яндекса», это позволило снять большинство проблем Отсутствовал функционал покупки в Алисе Для оформления покупки мы отправляли пользователя на сайт. Сейчас опция оплаты в Алисе проходит бета-тестирование. Система бронирования S7 отвечала в три раза медленнее, чем могла ждать Алиса Мы сделали сервис, который ускорил ответ. Наш бот задавал уточняющий вопрос и одновременно искал подходящие рейсы в API S7. Чтобы показывать ссылки с билетами на Facebook, нужен собственный дизайн всплывающих окон. Разработали свой дизайн карточек Решение 04/ Дополнительные функции Проверка статуса рейса Советы, если пользователь не определился с направлением Ответы на популярные вопросы Суть системы Алиса обрабатывает вопрос, заданный на естественном языке: «Самый дешевый билет из Москвы до Лондона на завтра» 05/ Схема Бронирование с помощью Алисы Обычное бронирование Бронирование через чат-бот Зайти на сайт, выбрать пункты вылета и прилёта, даты поездки, подобрать оптимальное время пересадки и так далее. Сказать Алисе: «Закажи мне билеты из Москвы в Сан-Франциско на конец лета экономом не дороже 60 тысяч рублей и без пересадок». Написать в Facebook «Хочу купить билет из Москвы в Казань на завтра». Чат-бот присылает ссылки на рейсы на сайте S7. 06/ Процесс разработки Шаг 1 Подготовительный этап Шаг 2 Обработка данных о типичных запросах клиентов S7 Создание сценариев диалогов Алисы с пользователями Основной этап Шаг 3 Шаг 4 Разработка и тестирование чат-бота в Facebook Интеграция чат-бота с API Алисы Шаг 5 Тестирование и запуск навыка 07/ Как работает навык для Алисы Человек говорит: «Закажи мне билеты из Москвы в Сан-Франциско на конец лета экономом не дороже 60 тысяч рублей и без пересадок» Бот реагирует: Переводит речь в текст Вычленяет из текста нужную информацию Вводит данные о рейсе на сайте Предлагает пользователю варианты Пользователь переходит по ссылке из диалога с Алисой на сайт и оплачивает билеты 08/ Демонстрация работы навыка 08/ Команда проекта Разработчик Разработчик Менеждер проекта Антон Капридов Сергей Веренцов Интересные факты Мы вошли в число первых сторонних разработчиков, создавших навык для Алисы. «Яндекс» показал навык для S7 на своей главной технологической конференции Yet Another Conference в году. 11/ Технологии Just AI Zendesk Платформа для создания чат-ботов и голосовых ассистентов Платформа для создания сервисов поддержки клиентов 12/ Что нового мы узнали Своя платформа эффективнее Как делать навыки для Алисы и не только Лучше сделать свой сервис, чем подстраиваться под чужой. Так появились zDialog для создания чат-ботов и One Dash для аналитики. С S7 начались проекты EORA с использованием технологий обработки естественного языка Узнать о Dialog Systems Другие проекты с Алисой 13/ О нас писали в СМИ «S7 Airlines научила голосового помощника Алису подбирать авиабилеты» «S7 Airlines научила голосового помощника Алису подбирать авиабилеты» Куда занесло «Алису»: краткий обзор рынка «умных» колонок в России и мире Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/workeat-whatsapp-bot",
    "title": "Бот для бесконтактной покупки питания через WhatsApp",
    "content": "En Главная / Портфолио / Разработка чат-ботов / Кейс для «WorkEat»‎ Бот для бесконтактной покупки питания через WhatsApp Основная информация 01/ Заказчик Задача Аудитория Как это работает? WorkEat Сделать бота для бесконтактной оплаты еды Офисные работники Выбрали еду и взяли с собой на рабочее место Оплатили на месте картой или потом, через бота в WhatsApp Насладились свежей едой без хлопот Вкусное питание в офисе: завтраки, обеды, перекусы, свежие фрукты и овощи, которые можно купить в микромаркете без участия продавца Суть проекта: Процесс разработки 02/ Изучаем задачу клиента и составляем смету Создаем первую версию бота на своей платформе zDialog Подключаем эквайринг Отдаем продукт заказчику Создаем дополнительный функционал Интегрируем взаимодействие с базой данных CROC Перейти к zDialog Пользовательский опыт 03/ Ненавязчивые уведомления Продуманая корзина Улучшенное распознавание штрихкода Дополнительная информация Для тех, кто не оплатил продукт вовремя будут приходить уведомления в бот несколько раз в сутки. В 18:00 (после работы) и утром. Каждый добавленный в течение дня товар расширяет корзину и не требует повторного старта сессии. Бот даст вам информацию о скидках, появлению продукта в наличии и много другой полезной информации. Усовершенствовали технологию для корректного и быстрого распознавания штрихкодов и qr-кодов. Подсчет КБЖУ Все товары в корзине и потребленные за день складываются в ИТОГО потребленной энергии. Чему мы научились? 04/ Ниша проекта была новой для нас, что позволило в процессе реализации научиться следующим навыкам: 01 Подключение эквайринга Продумали безперебойное подключение Apple Pay, Google play, оплату через сбербанк и другие банки. 02 Интегрирование нишевых баз данных Научились проектировать сложные структуры взаимодействия с базами данных разных спецефических ниш. 03 Интегрирование zDialog в WhatsApp Подружили нашу систему с WhatsApp. Теперь любые боты на этой платформе будут делаться по готовому модулю в 2 раза быстрее. Команда проекта 05/ Ильгизар Мурзаков Сергей Пономаренко Татьяна Попова Айдар Валеев Давид Моисеев Разработчик Разработчик Менеджер Разработчик / Team Lead Копирайтер WorkEat – это очень удобно , можно в спешке набрать готовой еды и заплатить в свободное время! Цитата пользователя чат-бота Елена Итоги проекта 06/ Получили опыт интеграции zDialog в WhatsApp Разобрались с подключением еквайринга Потренировались в проработке удобного взаимодействия Научились делать сложные операции с базами данных Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/absolyut-strahovanie-navyk-dlya-raschyota-strahovki",
    "title": "Навык, помогающий рассчитать страховку",
    "content": "En Главная / Портфолио / Навыки для голосовых ассистентов / Навык в Алисе, рассчитывающий страховку в Абсолют страхование Навык, помогающий рассчитать страховку Навык в Алисе Навык «Абсолют Страхование» поможет оформить страховку и быстро ответит на ваши вопросы по страховым продуктам Суть навыка Процесс разработки 01/ 1 месяц 1 год 3 месяца 1 месяц Сейчас создавали первую версию бота (ответы на вопросы о компании, помощь с навигацией по сайту) поддерживали бота разрабатывали расчёт поездки на отдых разрабатывали ответы на вопросы поддерживаем, улучшаем и переносим на другие платформы 2 года поддерживаем навык и радуемся, что он становится лучше и лучше :) Перейти к навыку Ключевые функции навыка 02/ 01 Расчёт стоимости страховки для выезда на отдых Помощь с расчётом ОСАГО 02 Ответы на вопросы 03 Схема работы навыка 03/ Перейти к навыку «Алиса, запусти навык \"Абсолют Страхование\"» Человек говорит: «Рассчитать стоимость страхования при выезде зарубеж» Алиса задаёт вопросы Интеграция с системой «Абсолют Страхование» Ответы на вопросы отправляются в систему «Абсолют Страхования» Система «Абсолют Страхование» делает расчёт на основе полученных данных и возвращает в навык Показываем расчёт, предлагаем оформить страховку и оставить телефон Команда проекта 04/ Сергей Пономаренко Менеджер Антон Капридов Разработчик Сергей Веренцов Копирайтер Татьяна Попова Аналитик / дизайнер диалогов Анна Михник Разработчик Технологии 05/ 02 Проект был построен на сторонней платформе Мы перевели его на нашу платформу zDialog Это позволило нам быстрее решать возникающие проблемы. Нам стало проще поддерживать проект, а сам проект стал работать стабильнее 01 Навык интегрирован с внутренней системой расчёта стоимости «Абсолют Страхование» Пользователь узнаёт стоимость страховки для выезда зарубеж, сообщая Алисе необходимую информацию. Так ему не нужно никуда ехать, звонить или заходить на другие сайты Узнать больше о zDialog Наши планы 06/ калькулятор страхования ипотечного кредита Перенести навык на другие платформы в виде бота К другим проектам Dialog Systems Добавить в бот новые расчёты калькулятор страхования автомобиля Cбер Telegram Маруся Виджет на сайт Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/kazanexpress-poisk-tovarov-po-foto",
    "title": "Система, позволяющая искать товарыпо фотографии на сайтеинтернет-магазина",
    "content": "En Главная / Портфолио / Поиск по картинке / Кейс для «KazanExpress» Система, позволяющая искать товары по фотографии на сайте интернет-магазина Поиск по изображениям Основная информация Заказчик KazanExpress.ru — маркетплейс китайских и российских товаров с бесплатной доставкой за один день. Аудитория Самый быстрорастущий маркетплейс в Европе Пользователи KazanExpress.ru Зачем нужна система Поднять конверсию продаж Смежный проект KazanExpress рекомендации Перейти к проекту Схема работы Проблема Человек не может четко сформулировать, что хочет купить, чтобы вбить в поиск Решение Поиск по фотографии желаемого объекта Пользователь заходит на сайт Загружает фотографию Система предлагает наиболее похожие предметы из каталога маркетплейса Пользователь доволен, конверсия интернет- магазина растет Технологии Сценарий пользователя на KazanExpress: Увидел классное платье/мебель в инстаграме и заскриншотил поиск поиск Увидел интересную вещь на улице поиск поиск Знает что ищет, просто лень вводить текст поиск поиск Трудности проекта Проблема Решение Проблема Решение Очень большая база данных. Нужно обеспечить быстрый поиск по ней. Используем индекс SCANN и оптимизируем нейронную сеть. Есть шанс, что модель обучится на популярных категориях товаров и на редких качество работы будет ниже. Используем аугментацию данных: увеличиваем частотность редких изображений в процессе обучения модели. Команда проекта Константин Кубрак Менеджер Владислав Виноградов Техлид Вячеслав Шульц ComputerVision инженер Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/kazanexpress-sistema-rekomendacij-na-sajte",
    "title": "Cистема персональных рекомендаций на сайте KazanExpress",
    "content": "En Главная / Портфолио / Компьютерное зрение и ИИ / Кейс для «KazanExpress» Cистема персональных рекомендаций на сайте KazanExpress Информация о проекте Клиент Задача Аудитория KazanExpress — маркетплейс китайских и российских товаров с бесплатной доставкой за один день. Повысить число покупок Пользователи сайта KazanExpress.ru Работает с года. Самый быстрорастущий маркетплейс в Европе. Суть проекта Покупатель на сайте видит дополнительный блок с товарами, которые могут ему понравиться. Процесс разработки Шаг 01 Согласование Шаг 02 Подготовка данных Шаг 03 Проработка архитектуры Шаг 06 Тестирование пользователями (сотрудники KazanExpress) Шаг 05 Обучение модели Шаг 04 Разработка Как работает система Пользователь заходит на сайт клиента Выбирает товар, кладет его в корзину Система предлагает товары, которые могут понадобиться покупателю Повышается средняя стоимость чека На чем основаны рекомендации История покупок конкретного пользователя Сравниваем покупки разных пользователей Смотрим на корзину, папку «мои желания» и уже совершенные покупки Не учитываем: местоположение и пол. У двух пользователей похожие покупки — называем их «пользователями- близнецами». Рекомендуем то, что уже купил «пользователь- близнец». Технологии Библиотека Spark фреймворк для обработки большого потока данных Матричное разложение ALS алгоритм, позволяющий обрабатывать действия пользователей в реальном времени намеренно ограничили систему теми пользователями, которые совершили не менее четырех покупок каждые две недели обновляем данные, чтобы система не перегружалась Маркетплейс — это всегда огромный массив данных (несколько миллионов строк в таблицах). Поэтому мы: Трудности проекта Проблема Приемка проекта затянулась, так как не было четких критериев качества. Вывод Нужно на переговорах с клиентом более детально прорабатывать и согласовывать метрики качества и способы их получения. Проблема В некоторые моменты сервис работал медленней, чем хотелось бы. Решение Нашли сложно воспроизводимый баг в коде и провели дополнительные оптимизации скорости работы алгоритмов. Цитата «Единственный недочет, на который жаловались при тестировании, — мужчине могли порекомендовать розовый чехольчик для телефона, но и с этим можно работать» Надежда Менеджер Команда проекта Менеджер Надежда Загвозкина Data Scientist Олег Дурыгин Junior Data Scientist Александра Щетинина Чему мы научились Более вдумчиво работать с библиотеками для рекомендательных систем Грамотно обрабатывать огромные массивы данных Наши планы Ведем переговоры с клиентом о поддержке и улучшении: новые параметры (пол, возраст, локация) оптимизация Надежда «Планируем и дальше развиваться в рекомендашках и наращивать компетенции». Менеджер Где можно применить наработки: Маркетплейсы, интернет-магазины и вообще любые сущности, которые что-то продают. Но лучше всего рекомендательные системы работают именно на огромных массивах данных. Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/intels-proverka-logotipa-na-plagiat",
    "title": "Система, позволяющая быстро проверить логотип на плагиат",
    "content": "En Главная / Портфолио / Поиск по картинке / Кейс для «INTELSONLINE» Система, позволяющая быстро проверить логотип на плагиат Поиск похожих изображений О клиенте 01/ ИНТЭЛСОНЛАЙН — крупное патентное бюро. Занимается сохранением интеллектуальной собственности. Работает с года. У ИНТЭЛСОНЛАЙН есть сервис poiskznakov.ru Для кого он? эксперты в области интеллектуальной собственности Он дает возможность проверить онлайн, является ли ваш товарный знак дубликатом креативные бюро компании, регистрирующие торговую марку или товарный знак Перейти к сервису Задачи, с которыми пришел клиент: 02/ ИНТЭЛСОНЛАЙН пришел с готовым запросом на нейросеть: Мы доработали его и расширили возможности сервиса У клиента был нерабочий, \"сырой\" алгоритм улучшение поддержка Процесс разработки 03/ Эксперты-патентоведы: Процесс занял выбрали товарных знаков и подобрали к каждому по 50 похожих. Наша команда разработчиков: обучила нейросеть на этом наборе данных. Изначально критериев сходства не было, нейросеть должна была их выделить исходя из примеров. 4 месяца Результат: нейросеть, обученная на 5 тысячах знаков, связывается с базой существующих товарных знаков – их 1,5 млн . Система проверяет логотип пользователя на сходство с ними. Схема работы системы 04/ Пользователь загружает изображение логотипа: Нейросеть сравнивает его с товарными знаками, зарегистрированными в странах СНГ, Балтии, а также Базе данных Всемирной организации интеллектуальной собственности Наша система выдает список товарных знаков с визуально сходным логотипом — потенциальный плагиат : Список ранжированный — самые похожие товарные знаки показываются вначале. Так мы экономим время экспертов. Команда проекта 05/ Computer Vision инженер MLOps инженер Менеджер проекта Data Scientist BackEnd разработчик Трудности проекта 06/ В data science всегда есть риск, что ничего не выйдет, просто потому что еще не появились подходящие инструменты. На их поиск обычно требуется много времени Но здесь все сложилось. Подобрали работающий алгоритм, добились 80-процентной точности и вовремя исправили ошибки, допущенные разработчиками-стажерами. Плохо успевали по срокам Что нам удалось 07/ 01 добиться 80-процентной точности показывать максимально актуальные изображения в первой сотне выдачи сэкономить заказчику время работы патентных поверенных Наши планы 09/ ускорить работу сервиса К другим проектам Dialog Systems подавать новые картинки в базу, чтобы нейросеть дообучалась на них Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/karcher-viktorina-s-voprosami-pro-uborku",
    "title": "Викторина с вопросамипро уборку",
    "content": "En Главная / Портфолио / Навыки для голосовых ассистентов / Кейс для «Karcher» Викторина с вопросами про уборку Навык в Алисе Алиса задает вопросы и рассказывает секреты эффективной уборки. В конце пользователь получает промокод на скидку на сайте Керхер. Суть навыка Процесс разработки 01/ 01 Определяем ЦА и делаем креативную концепцию Пишем контент Проектируем сценарий Пишем код 05 Тестируем 06 Анализируем результаты с помощью сервиса OneDash Весь контент мы писали сами. Мы молодцы :) Технологии 02/ В работе мы использовали следующие сервисы: Простая и удобная платформа для разработки чат-ботов, голосовых ассистентов и систем автоматизации контакт-центров. ИИ-сервис аналитики чат-ботов, который даёт детализированную оценку их эффективности. zDialog OneDash Перейти к OneDash Перейти к zDialog Схема работы навыка 03/ «Здравствуйте! Вы попали в университет чистоты и порядка Керхер» Алиса задает вопросы «Вы справились! Дарим промокод на покупку техники на сайте Керхер» «Алиса, запусти навык \"Викторина Керхер\"» Пользователь говорит: Человек выбирает ответ На каждый ответ пользователя есть индивидуальный комментарий системы с советом по уборке «Вы справились! Дарим промокод на покупку техники на сайте Керхер» Кому полезна разработанная механика? 04/ Механика будет полезна всем компаниям, которые производят товары или услуги. С помощью навыков в Алисе можно проводить промо-акции, викторины, рассказывать пользователям о товарах. Мы научили Алису отвечать нумерованным списком Раньше варианты ответа можно было сделать только отдельными кнопками. Это занимало много места на экране и плохо читалось. Интересный факт Мы сделали так, чтобы все варианты ответа помещались в одном сообщении Алисы. Пылесосы, швабры... А на что способна знаменитая минимойка Karcher? Удалить ржавчину Вывести старую краску со стен Нарисовать обратное граффити Помыть садовые дорожки Вопросы викторины 05/ Алиса последовательно задает пользователю 7 вопросов с четырьмя вариантами ответа. Вот примеры вопросов Команда проекта 06/ Иван Старков Руководитель проекта Разработчик Давид Моисеев Копирайтер Татьяна Попова Мы любим создавать викторины! 07/ Людям нравится проходить тесты, это весело Пользователи ощущают свое влияние на процесс, потому что система учитывает их ответы Скидка — приятный бонус по окончании теста Наши планы 08/ Придумать и разработать новые игровые механики, чтобы сделать навыки интереснее Сделать так, чтобы пользователю было еще удобнее читать ответы Алисы К другим проектам Dialog Systems Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/chat-boty/purina-friskies-chat-bot-na-sajte",
    "title": "Чат-бот в виджетена промо-сайтеи основном сайте Purina",
    "content": "En Главная / Портфолио / Разработка чат-ботов / Кейс для «Purina Friskies» Чат-бот в виджете на промо-сайте и основном сайте Purina Виджет на сайте Информация о проекте Заказчик Связанный проект Рекламное агентство Mindshare для PURINA Friskies — производителя корма для домашних питомцев. Purina Мастер-бот Универсальный бот для сайтов Purina, созданный для уменьшения нагрузки на горячую линию. Задача Создать чат-бот на промо-сайте. Аудитория Владельцы кошек и собак. Перейти к проекту Суть чат-бота Чат-бот в виджете промо-сайта, через который проходит вся коммуникация и целевые действия. Принцип работы чат-бота Перейти к проекту Человек покупает корм марки PURINA Friskies Проходит квиз Отправляет ссылку на отзыв в чат-бот Получает бонусный чек Загружает чеки в чат-бот на промо-сайте клиента Принимает участие в розыгрыше подарков Функции чат-бота Отвечать на вопросы о правилах акции, загрузке чеков, регистрации, продукции Friskies и заботе о питомцах. Запрашивать связь с оператором. Интересный факт За время акции было загружено больше чеков. Процесс разработки Подготовка сценария Шаг 01 Автоматическое тестирование Шаг 02 Ревью аналитика Шаг 03 Запуск чат-бота в полноценном режиме Шаг 06 Проверка сценария на работоспособность Шаг 05 Тестирование с менеджером Mindshare Шаг 04 Технологии Для разработки этого навыка мы использовали два наших продукта zDialog OneDash Простая и удобная платформа для разработки чат-ботов, голосовых ассистентов и систем автоматизации контакт-центров. ИИ-сервис аналитики чат-ботов. Позволяет проводить более глубокий анализ диалогов «человек-робот» и получать более точную оценку эффективности бота. Перейти к zDialog Перейти к OneDash Команда проекта Разработчик Разработчик Руководитель проекта Аналитик и QA тестировщик Антон Капридов Леша Шерченков Анна Михник Сергей Веренцов Другие проекты с Nestlé Purina в Алисе Викторина с вопросами об уходе за кошками. Перейти к проекту Перейти к проекту Чат-бот, который помогает перевести собаку на корм Purina ONE. Purina One Перейти к проекту Универсальный чат-бот для промо-страниц и основного сайта Purina. Purina мастер-бот Особенности проекта В данном проекте было задействовано сразу несколько компаний: Сторонняя компания осуществляла проверку системы на соответствие стандартам безопасности. Рекламные тексты писали специалисты маркетингового агентства Mindshare. Мы отвечали за разработку чат-бота. Разработка промо-сайта была отдана на аутсорсинг. Наши планы Дальнейшее сотрудничество с Mindshare Интеграция с WhatsApp Большой FAQ на сайт Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/nejroset-segmentaciya-video",
    "title": "Нейросеть, которая сегментирует кадры мобильного видео и «ищет»на них человека",
    "content": "En Главная / Портфолио / Компьютерное зрение и ИИ / Нейросеть для сегментации человека на видео Нейросеть, которая сегментирует кадры мобильного видео и «ищет» на них человека Основная информация Клиент Разработчик популярного мобильного приложения для художественной обработки фото и видео. Задача Создать инструмент, который будет сегментировать кадры видеопотока и выделять силуэт человека. Сервис должен запускаться на смартфонах. Применение Пользователь приложения сможет менять фон, как в Zoom, или «надевать» маску. Входит в топ-10 App Store в категории «Фото и видео» Решение Три нейросетевых модели для широкого диапазона мобильных устройств. Они работают с разной скоростью и точностью. Проблемы, с которыми мы столкнулись Проблема В нашей команде не было ни одного мобильного разработчика. Решение Мы подобрали специалистов, которые хорошо разбираются и в мобильной разработке, и в машинном обучении. Проблема Сервис должен был работать на разных смартфонах, включая «медленные». Решение Мы разработали три модели. Первую - для «медленных» смартфонов, вторую - для мощных флагманов и третью, оптимальную, - для основной группы устройств. Этапы разработки Изучили материалы и инструменты для разработки Подобрали библиотеку видео и изображений Обучили нейросеть «видеть» человека в кадре и очерчивать его контур На фото На видео Адаптировали сервис к запуску на мобильных устройствах Результаты Исходное изображение Идеальная маска Нейросеть очертила контур согласно вероятности, что пиксели относятся к фигуре человека. Итоговый контур. Нейросеть очертила его, предсказав положение человека в кадре. Image GT Mask Predicted Probs Predicted Mask Протестировали нейросеть и передали клиенту Пример тестирования модели на смартфоне Huawei P20 LTE Инструменты Vision Hub Хостинговая платформа для моделей компьютерного зрения. Модели запускаются на наших серверах и встраиваются в сторонние сервисы через REST API. Перейти к Vision Hub Команда проекта Константин Кубрак Менеджер проекта Владислав Виноградов Технический директор Александр Гращенков iOS-разработчик Вячеслав Шульц Сomputer vision engineer Дмитрий Гордин Android-разработчик Между прочим Это был наш первый опыт адаптации нейросетей для запуска на мобильных устройствах. Мы передали клиенту разработку и научили его воспроизводить эффект на своей платформе. Итоги Этот проект оказался сложнее, чем мы думали. Благодаря ему мы начали проводить аудит и консалтинг в области машинного обучения. Полученный опыт очень пригодился в другом проекте - когда мы разрабатывали приложение для снятия показаний счётчиков. Что такое ML-аудит «Умный» сервис для Фрисби Планы Сделать модель кросс‑платформенной - чтобы она запускалась на любых устройствах, а также в облаке. Объединить модель сегментации с моделью воспроизведения глубины кадра. Это повысит точность сегментации. Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/chat-boty/essa-nejroset-dlya-generacii-rolikov",
    "title": "Нейросеть, которая добавляет в видео анимацию и яркие цвета",
    "content": "En Главная / Портфолио / Разработка чат-ботов / Кейс для «ESSA» Нейросеть, которая добавляет в видео анимацию и яркие цвета Анализ и обработка видеопотоков О проекте 01/ Клиент Рекламное агентство APM – партнёр AB InBev Efes, производителя пива и безалгокольных напитков в России и Украине. Предыстория ESSA выпустили рекламу, в которой человек и его фон окрашивались в разные цвета. Задача Сделать сервис, в котором пользователи «ВКонтакте»‎ и Telegram смогут создавать похожие видео. Что мы придумали 02/ Нейросеть, которая создаёт разные видеоэффекты: «Неоновый бум» с появлением контрастных контуров тела, глаз и рта, одежды «Суперволна» с волной, заполняющей контур человека «Яркая вечеринка» со сплошной цветовой заливкой частей тела, глаз, губ, одежды Что умеет нейросеть 03/ Отличать человека от мебели и фона Сегментировать объекты и раскрашивать их в разные цвета Обозначать разными цветами глаза, волосы, рисунок на одежде Как это работает 04/ Пользователь считывает телефоном QR-код на бутылке с пивом ESSA В телефоне открывается страница сервиса ESSA «ВКонтакте» /start *загружает видео* *выбирает видеоэффект* Привет! Это чат-бот Essa,и я могу анимировать любое твое танцевальное видео! Отправь мне свое зажигательное видео длительностью от 14 до 40 секунд! Видео получено! Выбери стиль обработки для своего видео: Неоновый бум Суперволна Яркая вечеринка Мне потребуется некоторое время для обработки. Скоро всё пришлю. Всё получилось! Твоё видео доступно по ссылке https://... А вот как нейросеть «увидела»‎ нашу команду: Инструменты 05/ Для создания бота мы использовали собственные сервисы: Простая и удобная платформа для разработки чат-ботов, голосовых ассистентов и систем автоматизации контакт-центров. zDialog ИИ-сервис аналитики чат-ботов. Позволяет проводить более глубокий анализ диалогов «человек-робот» и получать более точную оценку эффективности бота. OneDash Перейти к zDialog Перейти к OneDash Мы создаем хостинговую платформу для исполнения моделей компьютерного зрения на любом устройстве. Модели исполняются на наших серверах и доступны по REST API Vision Hub Перейти к Vision Hub Процесс разработки 06/ Шаг 01 Обучили нейросеть «видеть» и cегментировать на видео части тела и одежду Шаг 02 Шаг 03 Шаг 04 Протестировали сервис, сделали отладку Шаг 05 Шаг 06 Написали руководство для пользователей, как лучше снимать видео Запустили сервис Обучили нейросеть «видеть» и сегментировать на видео мебель Сделали три разных эффекта для видео Трудности проекта 07/ 01 Проблема Пользовательские видео были низкого качества, с плохим освещением. Решение Чтобы улучшить картинку, мы использовали четыре модели компьютерного зрения. Они предсказывали положение объекта в кадре, делая изображение более чётким. 02 Проблема Нейросеть могла раскрашивать разные кадры по-разному; в видео появлялись шумы. Решение Мы улучшили работу алгоритма, который отвечал за чёткость картинки. 03 Проблема Долгая обработка видео: на 15-секундный ролик могло уходить 15 минут. Был риск, что пользователь не станет ждать или серверы не справятся с нагрузкой. Решение Мы стали указывать позицию пользователя в очереди на загрузку видео, если нужно было ждать. Добавили резервные мощности для стабильной работы. Результаты проекта 08/ Тонна новых знаний –это наш самый большой и сложный проект, связанный с сегментацией изображений на видео Клиент остался доволен и решил запустить похожий сервис для пользователей в Украине и Белоруссии Команда проекта 09/ 3 backend- разработчика Технический директор 2 менеджера проекта 2 аналитика данных Чему мы научились 10/ Использовать сложные комбинации моделей машинного зрения Обрабатывать видеозаписи разного качества, в том числе сжатые алгоритмами К другим проектам Dialog Systems Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/qiwi-poisk-anomalij",
    "title": "Модель, объясняющая аномалии в транзакциях QIWI",
    "content": "En Главная / Портфолио / Компьютерное зрение и ИИ / Кейс для «QIWI» Модель, объясняющая аномалии в транзакциях QIWI Анализ данных О клиенте QIWI — популярная электронная платежная система. С помощью QIWI-кошелька можно делать переводы между людьми, оплачивать счета и покупки в интернет- магазинах. Бизнесам QIWI предоставляет услуги эквайринга. Эквайринг — технология, позволяющая компаниям принимать безналичные платежи. Прошел платеж или нет Основной показатель качества в эквайринге — конверсия. Платеж не прошел — клиент недоволен Надо стараться предупреждать такие случаи. Ошибка платежа может быть: На стороне системы эквайринга На стороне провайдера На стороне банковских систем Была история, что у одного сотового оператора зачисления на счет не срабатывали с 1 до 3 ночи — оказалось, у него были неправильно выставлены часовые пояса. Наша задача Выявить признаки аномалий, из-за которых платежи не проходят. Схема работы Что мы делали: Смотрели данные о транзакциях, искали закономерности. Сентябрь - Ноябрь Гипотеза: С условным магазином деревянных игрушек транзакции будут успешней, чем с условным онлайн-казино Заказчик мог бы предлагать разные цены на эквайринг в зависимости от вероятности успеха транзакции Не смогли проверить, так как заказчик не дал доступ к информации о компаниях-провайдерах — это запрещено по протоколам безопасности. Технологии Классическая Data Science Команда проекта Сергей Веренцов Разработчик Рамиль Гизатуллин Разработчик Техническое решение На вход получили дампы баз данных QIWI в системе PostgreSQL Собрали предварительную разметку из баз данных Обработали данные с помощью Python Построили дерево решений Можно пройти по нему и увидеть, какой набор признаков ведет к неуспешным транзакциям Кластеризовали по группам провайдеров Каждый узел — условие на признак транзакции Оранжевые узлы — это там, где много транзакций не прошло. Трудности разработки Ограниченный доступ к данным Сложность предметной области Нет гарантий значимых результатов Проблемы с коммуникацией Например, понятие feature importance (важность признаков) привычно для датасаентиста, а аналитики лучше знакомы с корреляциями и воронками. Итоги проекта Подтвердили гипотезы клиента: Один пользователь пытался положить на телефон 3,5 миллиарда рублей. Разумеется, ничего не вышло. Транзакции с большими суммами с большой вероятностью не пройдут Есть проблемные провайдеры и группы провайдеров «Волшебной пилюли» — починить одну проблему, и транзакции вырастут — не нашлось , к сожалению. Но лишнее подтверждение — это всегда хорошо. Цитата Что нам дал проект Научились лучше планировать Поняли важность тесной работы с клиентом В течение недели работали в Иннополисе вместе с аналитиком QIWI, обменивались компетенциями. В году приняли участие в Product Hub QIWI Universe 3.0 Георгий Коннов, Руководитель направления QIWI Касса, один из бизнес-заказчиков программы «...В результате с командой EORA мы сделали кейс по аналитике данных, в ходе которого проанализировали работу наших провайдеров и смогли выявить новые факторы, снижающие конверсию оплаты. Работа с ними приведет к повышению оборота наших партнеров.» Читать статью Эмоции от проекта «Для наших data scientists это был уникальный опыт: мы получили финансовые данные о транзакциях, которые другими способами достать нереально. Объем данных был очень большой, пришлось развернуть под них целую инфраструктуру. Мы бок о бок работали со специалистами из QIWI, узнали, как устроены процессы внутри корпорации, научились взаимодействовать со службой безопасности.» CEO EORA О нас писали СМИ Читать статью Читать статью Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/frisbi-nejroset-dlya-raspoznavaniya-pokazanij-schetchikov",
    "title": "Нейросеть дляраспознаванияпоказаний счетчиков",
    "content": "En Главная / Портфолио / Компьютерное зрение и ИИ / Кейс для «Фрисби» Нейросеть для распознавания показаний счетчиков 01/ Основная информация Давайте вспомним классические методы снятия показаний. Каждый россиянин один раз в месяц оплачивает показания ЖКХ со своего счетчика аналогового образца. ФРИСБИ приняли решение облегчить этот вопрос и рассмотрели несколько решений. Решение Переоборудовать квартиры автоматическими счетчиками » « Дорого ( ₽/дом) Сложно обслуживать Немасштабируемо Решение Научить мобильное приложение считывать через камеру данные ЖКХ счетчиков » « Интересный факт! Это первый подобный проект в России Нейросеть распознает цифры в сложных случаях лучше, чем люди 02/ С какими трудностями столкнулись? Полувидимые цифры на аналоговых счетчиках 01 Проблема Была еще одна тонкость, с которой нам удалось справиться. Дело в том, что счетчики прокручиваются, и в окошке бывают видны две цифры одновременно С помощью размеченных данных мы натренировали модель на такие случаи — теперь она выбирает цифру, большую по значению Решение Скорость нейросети на мобилках Проблема: На мобильных устройствах нейросеть требует более простых решений из-за недостаточных мощностей разных устройств. Наши разработчики пересмотрели код под мобильное устройство не теряя эффективности нейросети. Решение: 03/ Схема работы системы 01 Загрузка изображения 02 Распознавание счетчика 03 Распознавание цифр на нём 04 Анализ 04/ Реальные примеры Локализация счётчика Локализация циферблата Выравнивание циферблата 05/ Команда проекта Техлид Константин Кубрак Разработчик Вячеслав Шульц 06/ Эмоции от проекта Константин Кубрак Менеджер, приехал на проект на «Черной Жемчужине» Вячеслав Шульц Разработчик, больше всех думал Классно, что наша система научилась распознавать циферблаты счетчиков любого типа. Вся команда испытывает восторг, потому что мы работаем с совершенно новым продуктом и со сложным современным проектом, аналогов которому нет в СНГ 07/ Наши планы Идея Оптимизировать нейросеть под мобильные операционные системы: Android iOS Для чего Чтобы модель могла: Работать быстрее на старых телефонах и слабых телефонах Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/skazki-dlya-gugl-assistenta",
    "title": "Навык, который читает ребенку сказки перед сном",
    "content": "En Главная / Портфолио / Навыки для голосовых ассистентов / Кейс для Google Ассистента Навык, который читает ребенку сказки перед сном Навык в Google Assistant Основная информация Клиент Крупный российский бренд детского питания. Аудитория Дети и их родители. Задача Разработать навык для голосового ассистента, который будет рассказывать популярные детские аудио-сказки. Суть навыка Голосовой ассистент может читать сказки и обращаться к ребенку по имени. Процесс разработки Изучаем полученный материал от клиента. Продумываем концепт, делаем игровую механику сказок. Озвучиваем проект. Мы присутствовали при озвучке проекта. Проводим UX - тестирование на тридцать человек. Проводим большое тестирование среди команды клиента. Вносим правки. Запускаем проект. Схема работы Попросить голосового помощника включить сказки. Назвать имя ребенка. Выбрать сказку. При повторном входе навык обращается по ранее указанному имени. Если имя нераспознано, то ассистент обращается просто - «малыш». Как выглядит навык Навык знакомится с ребенком. Предлагает сказки на выбор. Рассказывает аудио-сказку. Трудности проекта Проблема Решение К сожалению, в связи с особенностью Google Assistant,голосовая команда не всегда вызывала наше приложение. Мы сделали приложение не на zDialog, а на движке Google — Dialog Flow. Проблема Сначала сказки были интерактивными. Ассистент задавал ребенку вопросы. От вопросов дети приходили в игровое настроение, предполагалось, что сказки должны помочь заснуть Решение Мы отказались от этой идеи. Хотя технических проблем здесь не было. Сделали сказки в формате аудио-сказки. Цитата «Наверное, надо было по‑другому позиционировать приложение — не сказки на ночь, а сказки за завтраком , например. Тогда можно было бы использовать больше интерактивных элементов» «Наверное, надо было по‑другому позиционировать приложение — не сказки на ночь, а сказки за завтраком , например. Тогда можно было бы использовать больше интерактивных элементов» Немного статистики 5k - 6k пользователей месячная аудитория навыка 10k пользователей во время пика использования (март ) Интересный факт Наши сказки называли самым быстрорастущим навыком в русском Googlе Ассистенте. Как тестировали Сначала сделали закрытый тест для ста пользователей. Собрали обратную связь с малого трафика, внесли правки. Приняли решение остановиться на более простой механике. Сделали анонс, пошел трафик. Получили много жалоб, что дети не засыпают, так как интерактивная составляющая сказок их слишком увлекает. Провели UX-тестирование и по итогам внесли еще несколько улучшений. Протестировали на различных устройствах, обнаружили незамеченные ранее ошибки в самом ассистенте, исправили их. Интересные факты Записали более детских имен Более самых распространенных имен и имена по логам. Сами присутствовали в студии и помогали с озвучкой проекта Необходимо было контролировать сложную систему склейки предложений в тексте сказки. Команда проекта Менеджеры Разработчики Сергей Афанасьев Антон Шипов Руководитель проекта Сергей Веренцов Роман Афанасьев Антон Капридов Цитата пользователя навыка: Это настолько мило, что слушаю даже я, хотя мне уже 18 ;) Татьяна Итоги проекта Мы можем реализовывать подобные проекты для различных голосовых ассистентов. Например, приложение, которое помогает рассказывать сказки через видеозвонки с использованием масок. Нажимая на кнопку, вы соглашаетесь с нашей Политикой в отношении обработки персональных данных пользователей"
  },
  {
    "url": "https://eora.ru/cases/chat-boty/hr-bot-dlya-magnit-kotoriy-priglashaet-na-sobesedovanie",
    "title": "Бот для компании Магнит, который самостоятельно приглашает кандидатов на собеседование",
    "content": "ocker Клиент Компания «Магнит» — сеть розничных магазинов, третья по выручке частная компания России, лидер по количеству магазинов и географии их расположения. Автоматизировать первые шаги воронки для кандидатов на вакансию продавца и записать его на собеседование по телефону или офлайн-встречу Разработали чат-бота в Telegram для автоматизации найма на позицию продавца Задача Решения Теперь для записи на собеседование Суть кандидату не нужно связываться с менеджером — достаточно просто написать боту в любое удобное для себя время. Теперь для записи на собеседование Как это работает / 01 HR-бот интегрирован с системой Skillaz в которой хранятся все данные о кандидатах. Как только пользователь переходит в бот, он идентифицируется. Чат-бот запрашивает информацию о гражданстве, возраст, ФИО по паспорту, просит подтвердить номер телефона и город. Это позволит отсеять кандидатов по базовой воронке. Бот предлагает выбрать удобные дату и время. Слоты поступают централизованно из общей системы, поэтому не возникает пересечений с другими кандидатами. В день собеседования бот присылает напоминание. Если пользователь откликался на сайте на вакансию в конкретный магазин, то бот просит подтвердить эту информацию. После этого бот собирает данные и предлагает записаться на собеседование. Если пользователь ранее откликался через короткую форму на сайте, то бот предлагает ему выбрать позицию в конкретном магазине. Для этого он уточняет адрес, спрашивает, в магазине какого типа он хочет работать (Магнит у дома, Семейный, Магнит Косметик) и с помощью геопоиска ищет варианты в ближайших магазинах. Чем полезен HR-бот / 02 Чат-бот для сотрудников позволяет сократить время от первого контакта до записи на собеседование. Так как сеть быстро расширяется и нуждается в сотрудниках на позицию продавца, важно взаимодействовать с каждым. 01 Решает проблему взаимодействия с кандидатами в нерабочее для сотрудников центра подбора время. Например, по выходным или праздникам. 02 Вызывает доверие. Люди могут не брать трубку, если видят незнакомый номер, поэтому центр найма не всегда может дозвониться до кандидата. 03 Экономит на человеческих ресурсах сотрудников центра найма. 04 Иногда человеку просто комфортнее общаться с ботом в удобное для него время, чем подтверждать отклик по телефону Этот и другие боты в помощь рекрутерам ищите на странице HR-боты Проводить первичную обработку откликов Записывать на собеседования Задавать вопросы для первичного опроса кандидата Собирать данные Поддерживать контакт с кандидатом Напоминать о собеседовании Что умеет делать HR-бот / ,5 тыс. уникальных пользователей воспользовались ботом с января по март года ушло на разработку бота 2 месяца Немного статистики / 04 Настроить сквозную аналитику Добавить другие вакансии, например, сотрудники склада, логистики, производства и других Расширить источники входа в HR-бот, чтобы можно было подключиться к нему, например, сразу с hh.ru или других карьерных сайтов Чем полезен HR-бот / 05 Инструменты / 05 EORA Dialog Platform Перейти к инструменту Перейти к инструменту Yandex.Maps API Geocoder Перейти к инструменту FastAPI Перейти к инструменту Docker Команда проекта / 05 Маргарита Пылаева руководитель проекта Команда проекта / 05 Алексей Зеленов разработчик Команда проекта / 05 Анастасия Лисовая CUI-дизайнер Познакомиться с другими разработками вы можете на странице Услуги Перейти в портфолио Сообщение об успешной отправEn Бот для компании Магнит, который самостоятельно приглашает кандидатов на собеседование / / / Главная Портфолио Чат-бот HR-бот для компании Магнит HR-бот «Магнит» январь * Экспертизы Dialog Systems Yandex.Maps FastAPI Dке!"
  }
]